README.org
#+title: 基于 Nix Flakes 的 Emacs 配置
#+author: idiig
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
* 本配置
:PROPERTIES:
:header-args: :tangle no
:END:
** 目的
这份配置文件的特色是使用 Nix Flakes 同时管理 emacs 的包和 emacs 在使用
过程中会调用的外部程序。使用这个方法的主要目的是有以下理由：
- 同时协同 emacs 插件和其依赖的外部工具 ::
  emacs 内置的包管理器无法管理系统级别工具，比如用于检索的
  =consult-ripgrep= 会寻找可运行的 =ripgrep= 调用。这样我需要脱离 elisp 的设
  定文件去下载这个外部工具。还有很多编程语言也有这个问题。我的习惯是希
  望针对特定的项目文件夹定制所需的环境（比如使用 nix 和.dir-locals.el）。
  但是，类似于语言服务器这类本质与项目无关，但与我的编辑环境有关的设定，
  我倾向于使用与项目无关的环境。
** 其他方式做不到的
目前不依赖 emacs 的其他包管理工具的其他方式也有一些：
- git 子模块 ::
  这种方式可以管理 emacs 包，而且可以灵活的更新和回滚版本。但是这个方
  法也同样不方便整合系统级别的依赖。
- =twist.nix= 等基于 nix 的方法 ::
  在 nix 文件里写配置的话，确实可以使用 =${pkgs.xxx}= 的方式使用系统工具
  避免，在配置文件外单独下载。但完全使用 nix 的话，写配置的方式更新快，
  个人希望尽可能使用 elisp 的方式写配置。
** 本配置的做法
这份配置的解决法如下：
- 通过 org-babel 同时写 nix 和 elisp。前者用于版本，emacs 包，依赖的系
  统工具的管理，后者用于 emacs 本身的配置的管理。
- 可以在 elisp 中用 =$pkgs.git= 的方式直接引用Nix的包。
** 目前的缺点
目前使用下，这个配置方式也有一些缺点：
- 添加系统工具的时候，需要重启调试过程繁琐
- 依赖的系统工具多了以后，占用容量大
- nixpkgs 里的工具相对滞后，新包加入慢
* 实现方式
:PROPERTIES:
:header-args: :tangle no
:END:
下面以配置 =Magit= 为例说明这个配置的方法。这里和大多数的配置一样我们把
整体目的一致的包放在一个集群实现。每个集群主要分成两个子节点，一个用于
安装包和依赖项，另一个用于配置包本身。

依赖的部分可以从 =pkgs= (=nixpkgs.legacyPackages.${system}=) 同时安装
emacs 外部依赖（系统工具如 =git= ）。然后从 =epkgs=
(=pkgs.emacs.pkgs.withPackages=) 中安装emacs 的包。

这里稍微多做一些解释。在配置节里面，我利用了org-babel的一些文学编程特
性。首先我们在一个入口代码块中使用了 =:noweb=yes= [fn:lit-prog]。然后在
后面的代码块中我们使用 =:noweb-ref= 参照入口代码块，最后后续的这些代码块
都会在 =org-babel-tangle= (=C-c C-v C-t=) 时合并到这个入口代码块中输出为
flake.nix。

[fn:lit-prog] 关于文学编程中 =noweb= 的解释可以参考 [[https://www.cs.tufts.edu/~nr/noweb/][这个链接]] 。本身我们还有一个
=:session= 的方式更适合一些数据科学的工作流。这里我们主要为了和 =:tangle=
以前使用。
* 如何使用
:PROPERTIES:
:header-args: :tangle no
:END:
用emacs打开本文档， =M-x org-babel-tangle= 或使用快捷键 =C-c C-v t= 生成
flake.nix。接下去运行可以通过在终端运行下面进行调试和版本回滚：
** 调试
#+begin_src sh
  export NIXPKGS_ALLOW_UNFREE=1	# allow unfree packages
  nix run <path/to/this/config> \	# replace <path/to/this/config> with the actual path
      --impure \			# use impure mode
      --extra-experimental-features nix-command \ # enable nix-command feature
      --extra-experimental-features flakes # enable flakes feature
  source ~/.bashrc			 # source bash configuration
  ne			     # starts emacs with the new configuration
#+end_src
** 版本回滚
*** 使用git
#+begin_src sh
  git checkout <previous-commit>
  nix run <path/to/this/config> \	# replace <path/to/this/config> with the actual path
      --impure \			# use impure mode
      --extra-experimental-features nix-command \ # enable nix-command feature
      --extra-experimental-features flakes # enable flakes feature
  source ~/.bashrc			 # source bash configuration
  ne			     # starts emacs with the new configuration
#+end_src
*** 备份lock文件
#+begin_src sh
  nix flake metadata		# check flake metadata
  cp flake.lock flake.lock.bachup	# backup current lock file
  nix run --recreate-lock-file --inputs-from ./flake.lock.backup # recreate lock file
#+end_src
