README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-04 Tue 02:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>基于 Nix Flakes 的 Emacs 配置</title>
<meta name="author" content="idiig" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">基于 Nix Flakes 的 Emacs 配置</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org87cef0b">1. 本配置</a>
<ul>
<li><a href="#orgdb20202">1.1. 目的</a></li>
<li><a href="#org240a904">1.2. 其他方式做不到的</a></li>
<li><a href="#org5a37991">1.3. 本配置的做法</a></li>
<li><a href="#org6cb7a24">1.4. 目前的缺点</a></li>
</ul>
</li>
<li><a href="#org2e8cad4">2. 实现方式</a></li>
<li><a href="#org4a1635a">3. 如何使用</a>
<ul>
<li><a href="#org439c61f">3.1. 调试</a></li>
<li><a href="#orgc733819">3.2. 版本回滚</a>
<ul>
<li><a href="#org69b6efe">3.2.1. 使用git</a></li>
<li><a href="#orge0aa415">3.2.2. 备份lock文件</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgea2f005">4. 配置入口 (<code>flake.nix</code>)</a></li>
<li><a href="#org090a592">5. 配置本体</a>
<ul>
<li><a href="#org427eda8">5.1. Early-init</a></li>
<li><a href="#org28fff55">5.2. Emacs基建</a>
<ul>
<li><a href="#org6239f67">5.2.1. Mac OS 键位设定</a></li>
<li><a href="#orge177349">5.2.2. 包管理和其他基础</a></li>
<li><a href="#org47beaf3">5.2.3. 更好的默认设置</a></li>
</ul>
</li>
<li><a href="#org6f25f7a">5.3. CJK字体</a>
<ul>
<li><a href="#org1fae257">5.3.1. 依赖</a></li>
<li><a href="#orgf436fce">5.3.2. 配置</a></li>
</ul>
</li>
<li><a href="#org966bbc6">5.4. 日文</a>
<ul>
<li><a href="#orgfbb7fdc">5.4.1. 输入法 (ddskk)</a></li>
<li><a href="#org0cee40a">5.4.2. 检索（Migemo）</a></li>
</ul>
</li>
<li><a href="#org10f36e4">5.5. 中文</a>
<ul>
<li><a href="#org83decea">5.5.1. 输入法和基于输入法的检索 (pyim)</a></li>
</ul>
</li>
<li><a href="#org947df27">5.6. Git (<code>magit</code>)</a>
<ul>
<li><a href="#org9675fbd">5.6.1. 依赖</a></li>
<li><a href="#org3ca0ec2">5.6.2. 配置</a></li>
</ul>
</li>
<li><a href="#orgda5335d">5.7. 文档写作</a>
<ul>
<li><a href="#orgb19906d">5.7.1. 文档后缀</a></li>
<li><a href="#org993a978">5.7.2. 文档状态折行</a></li>
<li><a href="#org2aa7e2c">5.7.3. 在选中区域的状态下 <code>C-w</code> 删除选中的区域</a></li>
<li><a href="#orgec93a74">5.7.4. <code>C-M-\</code> 全局缩进</a></li>
<li><a href="#orgf32a6fa">5.7.5. <code>Shift-Ret</code> 下方插入空白行</a></li>
<li><a href="#orgcee81d7">5.7.6. <code>M--</code> 匹配到括号</a></li>
<li><a href="#org4f86c67">5.7.7. 点后插入空白</a></li>
</ul>
</li>
<li><a href="#org1091962">5.8. 编程工具</a>
<ul>
<li><a href="#org7137073">5.8.1. 我有可能使用的语言</a></li>
<li><a href="#lsp-bridge">5.8.2. 语言服务器 (<code>lsp-Bridge</code>)</a></li>
<li><a href="#org2d4ab87">5.8.3. <span class="todo TODO">TODO</span> Treesitter</a></li>
<li><a href="#orgcfad172">5.8.4. Snippet (<code>yasnippet</code>)</a></li>
<li><a href="#org11ff8b4">5.8.5. 基于 tresitter 的结构化编程</a></li>
<li><a href="#orgd68ece4">5.8.6. 自动化环境管理 (<code>direnv</code>)</a></li>
<li><a href="#org7692796">5.8.7. 终端 (<code>eat</code>)</a></li>
</ul>
</li>
<li><a href="#org9859c3b">5.9. 编程与文档语言</a>
<ul>
<li><a href="#org5bdb37a">5.9.1. Nix</a></li>
<li><a href="#orgd58a2dc">5.9.2. Lisp</a></li>
<li><a href="#org37018eb">5.9.3. Python</a></li>
<li><a href="#org805a26f">5.9.4. Haskell</a></li>
<li><a href="#org24185ab">5.9.5. R</a></li>
<li><a href="#org14e3a26">5.9.6. Go</a></li>
<li><a href="#orgd172290">5.9.7. Shell</a></li>
<li><a href="#org6a49d6d">5.9.8. jq</a></li>
<li><a href="#org5ca55c0">5.9.9. Make</a></li>
<li><a href="#org66b1763">5.9.10. TeX</a></li>
<li><a href="#org5bc426e">5.9.11. Typst</a></li>
<li><a href="#org11b5bec">5.9.12. Markdown</a></li>
<li><a href="#orgce1f1f6">5.9.13. Quarto</a></li>
<li><a href="#org3746008">5.9.14. XML</a></li>
<li><a href="#org0d7321f">5.9.15. JSON</a></li>
<li><a href="#orge63066f">5.9.16. Web</a></li>
<li><a href="#orgc0efa34">5.9.17. Java</a></li>
<li><a href="#org276ae8b">5.9.18. PlantUML</a></li>
<li><a href="#orgad530d6">5.9.19. GraphViz</a></li>
</ul>
</li>
<li><a href="#orgb2aad78">5.10. Org相关配置</a>
<ul>
<li><a href="#orgf29628f">5.10.1. Org本体</a></li>
<li><a href="#org2cbab1a">5.10.2. 文献引用处理器 (<code>citeproc-el</code>)</a></li>
<li><a href="#org7942b11">5.10.3. 出入引用配置 (<code>oc</code>, <code>oc-basic</code>)</a></li>
<li><a href="#org87c80dc">5.10.4. 幻灯片 (<code>org-present</code>)</a></li>
</ul>
</li>
<li><a href="#orgb3a30b2">5.11. AI辅助功能</a>
<ul>
<li><a href="#orgb442a04">5.11.1. Copilot</a></li>
<li><a href="#orgac02828">5.11.2. Chatbot (<code>gptel)</code></a></li>
<li><a href="#org676a018">5.11.3. AI-pairing programming (<code>Aidermacs</code>)</a></li>
<li><a href="#orgb67bf42">5.11.4. <span class="todo TODO">TODO</span> AI-Client (<code>claude-code</code>)</a></li>
</ul>
</li>
<li><a href="#org091a0de">5.12. 模态编辑 (<code>meow</code>)</a>
<ul>
<li><a href="#org07c8a33">5.12.1. 依赖</a></li>
<li><a href="#orgc6e1886">5.12.2. 配置</a></li>
</ul>
</li>
<li><a href="#org10853f9">5.13. 多线程丰富功能 (<code>EAF</code>)</a>
<ul>
<li><a href="#org1fabbd5">5.13.1. 依赖</a></li>
<li><a href="#org7527fcf">5.13.2. 配置</a></li>
</ul>
</li>
<li><a href="#org4c23f4b">5.14. 特殊扩展</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org87cef0b" class="outline-2">
<h2 id="org87cef0b"><span class="section-number-2">1.</span> 本配置</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdb20202" class="outline-3">
<h3 id="orgdb20202"><span class="section-number-3">1.1.</span> 目的</h3>
<div class="outline-text-3" id="text-1-1">
<p>
这份配置文件的特色是使用 Nix Flakes 同时管理 emacs 的包和 emacs 在使用过程中会调用的外部程序。使用这个方法的主要目的是有以下理由：
</p>
<dl class="org-dl">
<dt>同时协同 emacs 插件和其依赖的外部工具</dt><dd>emacs 内置的包管理器无法管理系统级别工具，比如用于检索的
<code>consult-ripgrep</code> 会寻找可运行的 <code>ripgrep</code> 调用。这样我需要脱离 elisp 的设定文件去下载这个外部工具。还有很多编程语言也有这个问题。我的习惯是希望针对特定的项目文件夹定制所需的环境（比如使用 nix 和.dir-locals.el）。但是，类似于语言服务器这类本质与项目无关，但与我的编辑环境有关的设定，我倾向于使用与项目无关的环境。</dd>
</dl>
</div>
</div>
<div id="outline-container-org240a904" class="outline-3">
<h3 id="org240a904"><span class="section-number-3">1.2.</span> 其他方式做不到的</h3>
<div class="outline-text-3" id="text-1-2">
<p>
目前不依赖 emacs 的其他包管理工具的其他方式也有一些：
</p>
<dl class="org-dl">
<dt>git 子模块</dt><dd>这种方式可以管理 emacs 包，而且可以灵活的更新和回滚版本。但是这个方法也同样不方便整合系统级别的依赖。</dd>
<dt><code>twist.nix</code> 等基于 nix 的方法</dt><dd>在 nix 文件里写配置的话，确实可以使用 <code>${pkgs.xxx}</code> 的方式使用系统工具避免，在配置文件外单独下载。但完全使用 nix 的话，写配置的方式更新快，个人希望尽可能使用 elisp 的方式写配置。</dd>
</dl>
</div>
</div>
<div id="outline-container-org5a37991" class="outline-3">
<h3 id="org5a37991"><span class="section-number-3">1.3.</span> 本配置的做法</h3>
<div class="outline-text-3" id="text-1-3">
<p>
这份配置的解决法如下：
</p>
<ul class="org-ul">
<li>通过 org-babel 同时写 nix 和 elisp。前者用于版本，emacs 包，依赖的系统工具的管理，后者用于 emacs 本身的配置的管理。</li>
<li>可以在 elisp 中用 <code>$pkgs.git</code> 的方式直接引用Nix的包。</li>
</ul>
</div>
</div>
<div id="outline-container-org6cb7a24" class="outline-3">
<h3 id="org6cb7a24"><span class="section-number-3">1.4.</span> 目前的缺点</h3>
<div class="outline-text-3" id="text-1-4">
<p>
目前使用下，这个配置方式也有一些缺点：
</p>
<ul class="org-ul">
<li>添加系统工具的时候，需要重启调试过程繁琐</li>
<li>依赖的系统工具多了以后，占用容量大</li>
<li>nixpkgs 里的工具相对滞后，新包加入慢</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2e8cad4" class="outline-2">
<h2 id="org2e8cad4"><span class="section-number-2">2.</span> 实现方式</h2>
<div class="outline-text-2" id="text-2">
<p>
下面以配置 <code>Magit</code> 为例说明这个配置的方法。这里和大多数的配置一样我们把整体目的一致的包放在一个集群实现。每个集群主要分成两个子节点，一个用于安装包和依赖项，另一个用于配置包本身。
</p>

<p>
依赖的部分可以从 <code>pkgs</code> (<code>nixpkgs.legacyPackages.${system}</code>) 同时安装
emacs 外部依赖（系统工具如 <code>git</code> ）。然后从 <code>epkgs</code>
(<code>pkgs.emacs.pkgs.withPackages</code>) 中安装emacs 的包。
</p>

<p>
这里稍微多做一些解释。在配置节里面，我利用了org-babel的一些文学编程特性。首先我们在一个入口代码块中使用了 <code>:noweb=yes</code> <sup><a id="fnr.lit-prog" class="footref" href="#fn.lit-prog" role="doc-backlink">1</a></sup>。然后在后面的代码块中我们使用 <code>:noweb-ref</code> 参照入口代码块，最后后续的这些代码块都会在 <code>org-babel-tangle</code> (<code>C-c C-v C-t</code>) 时合并到这个入口代码块中输出为
flake.nix。
</p>
</div>
</div>
<div id="outline-container-org4a1635a" class="outline-2">
<h2 id="org4a1635a"><span class="section-number-2">3.</span> 如何使用</h2>
<div class="outline-text-2" id="text-3">
<p>
用emacs打开本文档， <code>M-x org-babel-tangle</code> 或使用快捷键 <code>C-c C-v t</code> 生成
flake.nix。接下去运行可以通过在终端运行下面进行调试和版本回滚：
</p>
</div>
<div id="outline-container-org439c61f" class="outline-3">
<h3 id="org439c61f"><span class="section-number-3">3.1.</span> 调试</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">export NIXPKGS_ALLOW_UNFREE=1	# allow unfree packages
nix run &lt;path/to/this/config&gt; \	# replace &lt;path/to/this/config&gt; with the actual path
    --impure \			# use impure mode
    --extra-experimental-features nix-command \ # enable nix-command feature
    --extra-experimental-features flakes # enable flakes feature
source ~/.bashrc			 # source bash configuration
ne			     # starts emacs with the new configuration
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc733819" class="outline-3">
<h3 id="orgc733819"><span class="section-number-3">3.2.</span> 版本回滚</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org69b6efe" class="outline-4">
<h4 id="org69b6efe"><span class="section-number-4">3.2.1.</span> 使用git</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-sh">git checkout &lt;previous-commit&gt;
nix run &lt;path/to/this/config&gt; \	# replace &lt;path/to/this/config&gt; with the actual path
    --impure \			# use impure mode
    --extra-experimental-features nix-command \ # enable nix-command feature
    --extra-experimental-features flakes # enable flakes feature
source ~/.bashrc			 # source bash configuration
ne			     # starts emacs with the new configuration
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0aa415" class="outline-4">
<h4 id="orge0aa415"><span class="section-number-4">3.2.2.</span> 备份lock文件</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-sh">nix flake metadata		# check flake metadata
cp flake.lock flake.lock.bachup	# backup current lock file
nix run --recreate-lock-file --inputs-from ./flake.lock.backup # recreate lock file
</pre>
</div>
</div>
</div>
</div>
</div>
