README.org
* 配置入口 (=flake.nix=)
包的安装基于下面的 =flake.nix= 。可以看到这里使用了几个占位符：
- =<<epkgs>>= :: 这里放置 emacs 包的列表
- =<<ecfg>>= :: 这里放置 emacs 的配置代码
- =<<emacs-early-init-config>>= :: 这里放置 emacs 的 early-init 配置代码
- =<<externals>>= :: 这里放置外部包的定义

这些占位符会在后续的代码块中被替换。  
#+BEGIN_SRC nix :tangle flake.nix :noweb yes
  {
    description = "idiig's Emacs Configuration with Nix Flakes";

    inputs = {
      nixpkgs.url = "github:NixOS/nixpkgs/nixos-unstable";
      flake-utils.url = "github:numtide/flake-utils";
      emacs-overlay.url = "github:nix-community/emacs-overlay";
      <<externals>>
    };

    outputs = inputs@{ self, nixpkgs, flake-utils, emacs-overlay, ... }:
      let
        # 用于安装非 nixpkgs 元的外部包的函数
        mkPackages = pkgs: emacsPackages: import ./externals {
          inherit inputs pkgs emacsPackages;
        };
      in
        flake-utils.lib.eachDefaultSystem (system:
  	      let
            
  		      pkgs = import nixpkgs {
  			      inherit system;
  			      overlays = [ emacs-overlay.overlay ];
  		      };

  		      # 主配置文件
  		      emacsConfig = pkgs.writeText "init.el" ''
  	    <<ecfg>>
  	    '';

  		      # early-init 配置文件
  		      emacsEarlyInitConfig = pkgs.writeText "early-init.el" ''
  	    <<emacs-early-init-config>>
  	    '';

            # 首先定义你的基础 Emacs
            emacs = pkgs.emacs30-gtk3;

            # 定义覆盖函数
            overrides = final: prev: mkPackages pkgs final;
            
            # 创建扩展的包集合并选择包
            emacsWithPackages = ((pkgs.emacsPackagesFor emacs).overrideScope overrides).withPackages (epkgs: with epkgs; [
              <<epkgs>>
            ]);
            
  	      in {
  		      packages.default = pkgs.writeShellScriptBin "script" ''
  	      #!/usr/bin/env bash
  	      set -e

  	      # 导出配置到 nix-emacs
  	      EMACS_DIR="$HOME/nix-emacs"
  	      mkdir -p "$EMACS_DIR"
  	      ${pkgs.rsync}/bin/rsync ${emacsConfig} "$EMACS_DIR/init.el"
  	      ${pkgs.rsync}/bin/rsync ${emacsEarlyInitConfig} "$EMACS_DIR/early-init.el"

  	      # 路径
  	      <<sys-path>>

  	      # 更新 Emacs 路径（兼容 macOS 和 Linux）
          if sed --version 2>/dev/null | grep "(GNU sed)"; then
  		      sed -i '/^alias ne=/d' "$HOME/.bashrc"
  	      else
  		      sed -i \"\" '/^alias ne=/d' "$HOME/.bashrc"
  	      fi

  	      echo "alias ne='QT_QUICK_BACKEND=software LIBGL_ALWAYS_SOFTWARE=1 ${emacsWithPackages}/bin/emacs --init-dir \"$EMACS_DIR\"'" >> "$HOME/.bashrc"

  	      # 提示用户手动 source 而不是直接执行，以避免 shell 继承问题
  	      echo "请手动运行 'source ~/.bashrc' 以使 alias 生效"
  	      echo "Emacs 配置已同步到 $EMACS_DIR"
  	      '';  
  	      });
  }
#+END_SRC
* 配置本体
:PROPERTIES:
:header-args: :tangle no
:END:
** Early-init
:PROPERTIES:
:header-args: :noweb-ref emacs-early-init-config
:END:
#+begin_src emacs-lisp
  ;; 增加 GC 阈值，加快启动
  (setq gc-cons-threshold 402653184 gc-cons-percentage 0.6)

  ;; 启动完成后恢复正常 GC 设定
  (add-hook 'emacs-startup-hook
  	  (lambda ()
  	    (setq gc-cons-threshold 10485760
  		  gc-cons-percentage 0.1)))

  ;; 禁用bidi，加速大文件
  (setq-default bidi-display-reordering nil)
  (setq bidi-inhibit-bpa t
        long-line-threshold 1000
        large-hscroll-threshold 1000
        syntax-wholeline-max 1000)
#+end_src
** Emacs基建
*** Mac OS 键位设定
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  ;; 在mac中使用Command key作为meta
  (setq mac-option-key-is-meta nil
        mac-command-key-is-meta t
        mac-command-modifier 'meta
        mac-option-modifier 'none)

  ;; 便于使用mac的JIS日语键盘
  (global-set-key (kbd "C-¥") 'toggle-input-method)
#+end_src
*** 包管理和其他基础
这里我考虑了到底是否要使用 =use-package= 。因为我现在在使用 org mode
写配置文件的目的是希望可以穿插自然语言的代码描述，所以需要拆分代码。
=use-package= 这种一体成型的写法不是很适合这种风格。但考虑了实际写的过
程，我觉得大多数情况可以在配置代码前面作完整的整理，而不需要过于细粒度
的代码表述，然后在迁移的过程可能也比较简单。所以我最后还是决定改成使用
=use-package= 了。
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
- =use-package= ：用简介的宏语言描述包
- =diminish= ：用于隐藏一些 minor mode
#+begin_src nix
  use-package
    diminish
#+end_src
**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (require 'use-package)
  (require 'diminish)
#+end_src
*** 更好的默认设置
**** 本体的设定
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  ;; 关闭警告声
  (setq ring-bell-function 'ignore)

  ;; 确认使用y或n，而不是yes或no。
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; 不自动生成备份文件
  (setq make-backup-files nil)

  ;; 选中文字能被整体替换（与其他文本编辑器相同）
  (delete-selection-mode 1)

  ;; 文件最后添加新行
  (setq require-final-newline t)

  ;; 文件在外部更新时buffer更新
  (global-auto-revert-mode 1)
#+end_src
**** 优化长文档 (=so-long=)
***** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  so-long
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package so-long
    :init
    (global-so-long-mode +1))
#+end_src
**** UI
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
***** 基础
#+begin_src emacs-lisp
  ;; 基础设置
  (tool-bar-mode -1) ;; 关闭工具栏
  (scroll-bar-mode -1) ;; 关闭文件滑动控件
  (setq inhibit-splash-screen 1) ;; 关闭启动帮助画面
  (setq initial-frame-alist (quote ((fullscreen . maximized)))) ;; 全屏
  (setq initial-scratch-message nil) ;; 关闭scratch message
  (setq inhibit-startup-message t) ;; 关闭启动信息
  (setq frame-title-format
        ;; 窗口显示文件路径/buffer名
        '("" " idiig - "
          (:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name)) "%b"))))
  (setq ns-use-proxy-icon nil)  ;; 删除frame icon
#+end_src
***** 主题
#+begin_src emacs-lisp
  (require-theme 'modus-themes)
#+end_src
***** 写作和展示UI（手动开启）  
****** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  spacious-padding
    writeroom-mode
#+end_src
****** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package spacious-padding
    :config
    (setq spacious-padding-widths
          '( :internal-border-width 15
             :header-line-width 4
             :mode-line-width 6
             :tab-width 4
             :right-divider-width 30
             :scroll-bar-width 8))

    ;; Read the doc string of `spacious-padding-subtle-mode-line' as it
    ;; is very flexible and provides several examples.
    (setq spacious-padding-subtle-mode-line
          `( :mode-line-active 'default
             :mode-line-inactive vertical-border)))
#+end_src
**** 光标跳到新窗口
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:

emacs在打开新的窗口时，默认光标维持在原来的窗口。比如当你使用
=describe-function= 时，光标不会跳到函数的简介窗口。在这类窗口我们本身
可以按 =q= 来退出和关闭窗口。所以跳转到新窗口非常便利。

- 专用buffer（display-buffer行为；主要影响 Emacs 自动创建的窗口（如
  help、compilation 等）。注意这里也会影响到 =magit= 这类 transient 窗
  口
  
#+begin_src emacs-lisp
  (setq switch-to-buffer-obey-display-actions t)
  (setq switch-to-buffer-in-dedicated-window 'pop)
  (customize-set-variable 'display-buffer-base-action
  			'((display-buffer-reuse-window display-buffer-same-window)
  			  (reusable-frames . t)))
#+end_src

- split-window时转跳到新窗口
  
#+begin_src emacs-lisp
  (defadvice split-window-below (after split-window-below-and-switch activate)
    "切换到新分割的窗口"
    (when (called-interactively-p 'any)
      (other-window 1)))

  (defadvice split-window-right (after split-window-right-and-switch activate)
    "切换到新分割的窗口"
    (when (called-interactively-p 'any)
      (other-window 1)))
#+end_src

**** 窗口的放大缩小转变为持续的行为
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
而不是要一直要重复 =C-x= 按键。后续行为使用默认 =^, V, {, }= 。这里我没用
=C-x v= 是因为这个键位目前用于 =vc= 。
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x V") 'shrink-window)

  (defun idiig/window-adjust-advice (orig-fun &rest args)
    "使用 Emacs 风格按键 (^, V, {, }, +) 持续调整窗口大小。"
    (let* ((ev last-command-event)
  	 (echo-keystrokes nil))
      ;; 执行初始调整
      (apply orig-fun args)

      ;; 设置 transient map
      (let ((delta (car args))) 
        (set-transient-map
         (let ((map (make-sparse-keymap)))
  	 ;; 垂直调整
  	 (define-key map (kbd "^")
  		     `(lambda () (interactive) (enlarge-window ,delta nil)))
  	 (define-key map (kbd "V")
  		     `(lambda () (interactive) (shrink-window ,delta nil)))

  	 ;; 水平调整
  	 (define-key map (kbd "{")
  		     `(lambda () (interactive) (shrink-window ,delta t)))
  	 (define-key map (kbd "}")
  		     `(lambda () (interactive) (enlarge-window ,delta t)))

  	 ;; 平衡窗口
  	 (define-key map (kbd "+")
  		     (lambda () (interactive) (balance-windows)))
  	 ;; 最大化窗口
  	 (define-key map (kbd "M")
  		     (lambda () (interactive) (maximize-window)))
  	 ;; 最小化窗口
  	 (define-key map (kbd "m")
  		     (lambda () (interactive) (minimize-window)))
  	 map)
         nil nil
         "Use %k for further adjustment"))))

  ;; 添加 advice
  (advice-add 'enlarge-window :around #'idiig/window-adjust-advice)
  (advice-add 'shrink-window :around #'idiig/window-adjust-advice)
  (advice-add 'enlarge-window-horizontally :around #'idiig/window-adjust-advice)
  (advice-add 'shrink-window-horizontally :around #'idiig/window-adjust-advice)
  (advice-add 'maximize-window :around #'idiig/window-adjust-advice)
  (advice-add 'minimize-window :around #'idiig/window-adjust-advice)
#+end_src

