README.html
<div id="outline-container-orgea2f005" class="outline-2">
<h2 id="orgea2f005"><span class="section-number-2">4.</span> 配置入口 (<code>flake.nix</code>)</h2>
<div class="outline-text-2" id="text-4">
<p>
包的安装基于下面的 <code>flake.nix</code> 。可以看到这里使用了几个占位符：
</p>
<dl class="org-dl">
<dt><code>&lt;&lt;epkgs&gt;&gt;</code></dt><dd>这里放置 emacs 包的列表</dd>
<dt><code>&lt;&lt;ecfg&gt;&gt;</code></dt><dd>这里放置 emacs 的配置代码</dd>
<dt><code>&lt;&lt;emacs-early-init-config&gt;&gt;</code></dt><dd>这里放置 emacs 的 early-init 配置代码</dd>
<dt><code>&lt;&lt;externals&gt;&gt;</code></dt><dd>这里放置外部包的定义</dd>
</dl>

<p>
这些占位符会在后续的代码块中被替换。  
</p>
<div class="org-src-container">
<pre class="src src-nix">{
  description = "idiig's Emacs Configuration with Nix Flakes";

  inputs = {
    nixpkgs.url = "github:NixOS/nixpkgs/nixos-unstable";
    flake-utils.url = "github:numtide/flake-utils";
    emacs-overlay.url = "github:nix-community/emacs-overlay";

  };

  outputs = inputs@{ self, nixpkgs, flake-utils, emacs-overlay, ... }:
    let
      # 用于安装非 nixpkgs 元的外部包的函数
      mkPackages = pkgs: emacsPackages: import ./externals {
        inherit inputs pkgs emacsPackages;
      };
    in
      flake-utils.lib.eachDefaultSystem (system:
              let

                      pkgs = import nixpkgs {
                              inherit system;
                              overlays = [ emacs-overlay.overlay ];
                      };

                      # 主配置文件
                      emacsConfig = pkgs.writeText "init.el" ''
            ;; 在mac中使用Command key作为meta
            (setq mac-option-key-is-meta nil
                  mac-command-key-is-meta t
                  mac-command-modifier 'meta
                  mac-option-modifier 'none)

            ;; 便于使用mac的JIS日语键盘
            (global-set-key (kbd "C-¥") 'toggle-input-method)
            (require 'use-package)
            (require 'diminish)
            ;; 关闭警告声
            (setq ring-bell-function 'ignore)

            ;; 确认使用y或n，而不是yes或no。
            (defalias 'yes-or-no-p 'y-or-n-p)

            ;; 不自动生成备份文件
            (setq make-backup-files nil)

            ;; 选中文字能被整体替换（与其他文本编辑器相同）
            (delete-selection-mode 1)

            ;; 文件最后添加新行
            (setq require-final-newline t)

            ;; 文件在外部更新时buffer更新
            (global-auto-revert-mode 1)
            (use-package so-long
              :init
              (global-so-long-mode +1))
            ;; 基础设置
            (tool-bar-mode -1) ;; 关闭工具栏
            (scroll-bar-mode -1) ;; 关闭文件滑动控件
            (setq inhibit-splash-screen 1) ;; 关闭启动帮助画面
            (setq initial-frame-alist (quote ((fullscreen . maximized)))) ;; 全屏
            (setq initial-scratch-message nil) ;; 关闭scratch message
            (setq inhibit-startup-message t) ;; 关闭启动信息
            (setq frame-title-format
                  ;; 窗口显示文件路径/buffer名
                  '("" " idiig - "
                    (:eval (if (buffer-file-name)
                               (abbreviate-file-name (buffer-file-name)) "%b"))))
            (setq ns-use-proxy-icon nil)  ;; 删除frame icon
            (require-theme 'modus-themes)
            (use-package spacious-padding
              :config
              (setq spacious-padding-widths
                    '( :internal-border-width 15
                       :header-line-width 4
                       :mode-line-width 6
                       :tab-width 4
                       :right-divider-width 30
                       :scroll-bar-width 8))

              ;; Read the doc string of `spacious-padding-subtle-mode-line' as it
              ;; is very flexible and provides several examples.
              (setq spacious-padding-subtle-mode-line
                    `( :mode-line-active 'default
                       :mode-line-inactive vertical-border)))
            (setq switch-to-buffer-obey-display-actions t)
            (setq switch-to-buffer-in-dedicated-window 'pop)
            (customize-set-variable 'display-buffer-base-action
                                '((display-buffer-reuse-window display-buffer-same-window)
                                  (reusable-frames . t)))
            (defadvice split-window-below (after split-window-below-and-switch activate)
              "切换到新分割的窗口"
              (when (called-interactively-p 'any)
                (other-window 1)))

            (defadvice split-window-right (after split-window-right-and-switch activate)
              "切换到新分割的窗口"
              (when (called-interactively-p 'any)
                (other-window 1)))
            (global-set-key (kbd "C-x V") 'shrink-window)

            (defun idiig/window-adjust-advice (orig-fun &amp;rest args)
              "使用 Emacs 风格按键 (^, V, {, }, +) 持续调整窗口大小。"
              (let* ((ev last-command-event)
                 (echo-keystrokes nil))
                ;; 执行初始调整
                (apply orig-fun args)

                ;; 设置 transient map
                (let ((delta (car args))) 
                  (set-transient-map
                   (let ((map (make-sparse-keymap)))
                 ;; 垂直调整
                 (define-key map (kbd "^")
                             `(lambda () (interactive) (enlarge-window ,delta nil)))
                 (define-key map (kbd "V")
                             `(lambda () (interactive) (shrink-window ,delta nil)))

                 ;; 水平调整
                 (define-key map (kbd "{")
                             `(lambda () (interactive) (shrink-window ,delta t)))
                 (define-key map (kbd "}")
                             `(lambda () (interactive) (enlarge-window ,delta t)))

                 ;; 平衡窗口
                 (define-key map (kbd "+")
                             (lambda () (interactive) (balance-windows)))
                 ;; 最大化窗口
                 (define-key map (kbd "M")
                             (lambda () (interactive) (maximize-window)))
                 ;; 最小化窗口
                 (define-key map (kbd "m")
                             (lambda () (interactive) (minimize-window)))
                 map)
                   nil nil
                   "Use %k for further adjustment"))))

            ;; 添加 advice
            (advice-add 'enlarge-window :around #'idiig/window-adjust-advice)
            (advice-add 'shrink-window :around #'idiig/window-adjust-advice)
            (advice-add 'enlarge-window-horizontally :around #'idiig/window-adjust-advice)
            (advice-add 'shrink-window-horizontally :around #'idiig/window-adjust-advice)
            (advice-add 'maximize-window :around #'idiig/window-adjust-advice)
            (advice-add 'minimize-window :around #'idiig/window-adjust-advice)
            ;; 不存在文档时询问是否新建
