README.org
**** 文件的保存与新建
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  ;; 不存在文档时询问是否新建
  (add-hook 'before-save-hook
            (lambda ()
              (when buffer-file-name
                (let ((dir (file-name-directory buffer-file-name)))
                  (when (and (not (file-exists-p dir))
                             (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                    (make-directory dir t))))))

  ;; 找文件时若无母文档则新建 
  (defadvice find-file (before make-directory-maybe
                               (filename &optional wildcards) activate)
    "Create parent directory if not exists while visiting file."
    (unless (file-exists-p filename)
      (let ((dir (file-name-directory filename)))
        (when dir
          (unless (file-exists-p dir)
            (make-directory dir t))))))
#+end_src

**** 最近文件
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package recentf
    :defer t
    :commands
    (consult-recent-file)
    :init
    (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory)
          recentf-max-saved-items 500
          recentf-max-menu-items 10)
    (setq recentf-exclude
          '("COMMIT_MSG"
            "COMMIT_EDITMSG"
            "github.*txt$"
            "/tmp/"
            "/sudo:"
            "/TAGS$"
            "/GTAGS$"
            "/GRAGS$"
            "/GPATH$"
            "\\.mkv$"
            "\\.mp[34]$"
            "\\.avi$"
            "\\.sub$"
            "\\.srt$"
            "\\.ass$"
            ".*png$"
            "Nutstore/org-files/"
            "bookmarks"))
    (setq recentf-max-saved-items 2048)
    (recentf-mode 1))

  ;; cleanup recent files
  (defun idiig/cleanup-recentf ()
    (progn
      (and (fboundp 'recentf-cleanup)
           (recentf-cleanup))))
  (add-hook 'kill-emacs-hook #'idiig/cleanup-recentf)
#+end_src

- 自动保存文件设置
  
#+begin_src emacs-lisp
  (use-package savehist
    :init
    (setq savehist-additional-variables
          ;; search entries
          '(search-ring regexp-search-ring)
          ;; 每一分钟保存一次
          savehist-autosave-interval 60
          ;; keep the home clean
          savehist-file (expand-file-name "savehist" user-emacs-directory))
    (savehist-mode t))
#+end_src

- 书签功能，打开时自动到原先编辑的位置

#+begin_src emacs-lisp
  (use-package bookmark
    :init
    (setq bookmark-default-file (expand-file-name "bookmarks" user-emacs-directory)
          bookmark-save-flag 1))
#+end_src

- 保存文件的编辑位置

#+begin_src emacs-lisp
  (use-package saveplace
    :init
    (setq save-place-file (expand-file-name "place" user-emacs-directory))
    (save-place-mode 1))
#+end_src

**** 文件管理 (=Dired=)
#+begin_src emacs-lisp
  (use-package dired
    :commands (dired dired-jump)
    :custom
    (dired-listing-switches "-alh")	; Use human-readable sizes
    (dired-dwim-target t)		    ; Try to be smart about guessing target directory
    (dired-recursive-deletes 'always) ; Always delete and copy recursively
    (dired-recursive-copies 'always)  ; Always delete and copy recursively
    :hook
    (dired-mode . auto-revert-mode)
    :config
    ;; Enable some commands by default
    (put 'dired-find-alternate-file 'disabled nil)
    (put 'dired-find-alternate-file 'disabled nil))
#+end_src
**** 便利的光标首尾移动
***** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  mwim
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
*mwim*: 跳到代码之前而非最前，或者代码后面而不是最后
#+begin_src emacs-lisp
  (use-package mwim
    :bind
    ("C-a" . mwim-beginning-of-code-or-line-or-comment)
    ("C-e" . mwim-end-of-code-or-line)
    :commands
    (mwim-beginning-of-code-or-line-or-comment
     mwim-end-of-code-or-line))
#+end_src

**** 折行与复原
***** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  unfill
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
- 物理折行与复原
#+begin_src emacs-lisp
  (use-package unfill
    :bind
    ("M-q" . unfill-toggle)
    :commands
    (unfill-toggle))
#+end_src
**** 更好的minibuffer
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
***** 原生设定
#+begin_src emacs-lisp
  (use-package emacs
    :init
    (progn
      ;; 为`completing-read-multiple'添加提示，比如[CRM<separator>]
      (defun crm-indicator (args)
        (cons (format "[CRM%s] %s"
                      (replace-regexp-in-string
                       "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                       crm-separator)
                      (car args))
              (cdr args)))
      (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

      ;; 不允许鼠标出现在minibuffer的提示中
      (setq minibuffer-prompt-properties
            '(read-only t cursor-intangible t face minibuffer-prompt))
      (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

      ;; 在emacs 28以后，非当前mode的指令都会被隐藏，vertico的指令也会隐藏
      (setq read-extended-command-predicate
            #'command-completion-default-include-p)

      ;; minibuffer可循环
      (setq enable-recursive-minibuffers t)))

  ;; http://trey-jackson.blogspot.com/2010/04/emacs-tip-36-abort-minibuffer-when.html
  ;; 使用鼠标时关闭minibuffer
  (defun idiig/stop-using-minibuffer ()
    "kill the minibuffer"
    (when (and (>= (recursion-depth) 1) (active-minibuffer-window))
      (abort-recursive-edit)))
  (add-hook 'mouse-leave-buffer-hook 'idiig/stop-using-minibuffer)

#+end_src

***** 基础五件套
****** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  vertico
    orderless
    marginalia
    embark
    consult
    embark-consult
#+end_src

****** 配置
******* *Vertico*: 提供minibuffer补全UI
#+begin_src emacs-lisp
  (use-package vertico
    :after consult
    :custom
    (vertico-count 9)
    (vertico-cycle t)
    :init
    (vertico-mode))
#+end_src
