README.html
            (add-hook 'before-save-hook
                      (lambda ()
                        (when buffer-file-name
                          (let ((dir (file-name-directory buffer-file-name)))
                            (when (and (not (file-exists-p dir))
                                       (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                              (make-directory dir t))))))

            ;; 找文件时若无母文档则新建 
            (defadvice find-file (before make-directory-maybe
                                         (filename &amp;optional wildcards) activate)
              "Create parent directory if not exists while visiting file."
              (unless (file-exists-p filename)
                (let ((dir (file-name-directory filename)))
                  (when dir
                    (unless (file-exists-p dir)
                      (make-directory dir t))))))
            (use-package recentf
              :defer t
              :commands
              (consult-recent-file)
              :init
              (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory)
                    recentf-max-saved-items 500
                    recentf-max-menu-items 10)
              (setq recentf-exclude
                    '("COMMIT_MSG"
                      "COMMIT_EDITMSG"
                      "github.*txt$"
                      "/tmp/"
                      "/sudo:"
                      "/TAGS$"
                      "/GTAGS$"
                      "/GRAGS$"
                      "/GPATH$"
                      "\\.mkv$"
                      "\\.mp[34]$"
                      "\\.avi$"
                      "\\.sub$"
                      "\\.srt$"
                      "\\.ass$"
                      ".*png$"
                      "Nutstore/org-files/"
                      "bookmarks"))
              (setq recentf-max-saved-items 2048)
              (recentf-mode 1))

            ;; cleanup recent files
            (defun idiig/cleanup-recentf ()
              (progn
                (and (fboundp 'recentf-cleanup)
                     (recentf-cleanup))))
            (add-hook 'kill-emacs-hook #'idiig/cleanup-recentf)
            (use-package savehist
              :init
              (setq savehist-additional-variables
                    ;; search entries
                    '(search-ring regexp-search-ring)
                    ;; 每一分钟保存一次
                    savehist-autosave-interval 60
                    ;; keep the home clean
                    savehist-file (expand-file-name "savehist" user-emacs-directory))
              (savehist-mode t))
            (use-package bookmark
              :init
              (setq bookmark-default-file (expand-file-name "bookmarks" user-emacs-directory)
                    bookmark-save-flag 1))
            (use-package saveplace
              :init
              (setq save-place-file (expand-file-name "place" user-emacs-directory))
              (save-place-mode 1))
            (use-package mwim
              :bind
              ("C-a" . mwim-beginning-of-code-or-line-or-comment)
              ("C-e" . mwim-end-of-code-or-line)
              :commands
              (mwim-beginning-of-code-or-line-or-comment
               mwim-end-of-code-or-line))
            (use-package unfill
              :bind
              ("M-q" . unfill-toggle)
              :commands
              (unfill-toggle))
            (use-package emacs
              :init
              (progn
                ;; 为`completing-read-multiple'添加提示，比如[CRM&lt;separator&gt;]
                (defun crm-indicator (args)
                  (cons (format "[CRM%s] %s"
                                (replace-regexp-in-string
                                 "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                                 crm-separator)
                                (car args))
                        (cdr args)))
                (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

                ;; 不允许鼠标出现在minibuffer的提示中
                (setq minibuffer-prompt-properties
                      '(read-only t cursor-intangible t face minibuffer-prompt))
                (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

                ;; 在emacs 28以后，非当前mode的指令都会被隐藏，vertico的指令也会隐藏
                (setq read-extended-command-predicate
                      #'command-completion-default-include-p)

                ;; minibuffer可循环
                (setq enable-recursive-minibuffers t)))

            ;; http://trey-jackson.blogspot.com/2010/04/emacs-tip-36-abort-minibuffer-when.html
            ;; 使用鼠标时关闭minibuffer
            (defun idiig/stop-using-minibuffer ()
              "kill the minibuffer"
              (when (and (&gt;= (recursion-depth) 1) (active-minibuffer-window))
                (abort-recursive-edit)))
            (add-hook 'mouse-leave-buffer-hook 'idiig/stop-using-minibuffer)

            (use-package vertico
              :after consult
              :custom
              (vertico-count 9)
              (vertico-cycle t)
              :init
              (vertico-mode))
