README.org
******* *Maginalia*: 增强minubuffer的annotation
#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    ;; 只在minibuffer启用快捷键
    :bind (:map minibuffer-local-map ("M-A" . marginalia-cycle))
    :init
    (setq marginalia-align-offset 5)
    :config
    (marginalia-mode))
#+end_src
******* *Consult*: 增强minibuffer的检索
#+begin_src emacs-lisp
  (use-package consult
    :hook (after-init . (lambda () (require 'consult)))
    :bind (([remap M-x] . execute-extended-command)
           ([remap goto-line] . consult-goto-line)
           ([remap switch-to-buffer] . consult-buffer)
           ([remap find-file] . find-file)
  	 ([remap imenu] . consult-imenu)
           ("C-c r" . consult-recent-file)
           ("C-c y" . consult-yasnippet)
           ("C-c f" . consult-find)
           ("C-c s" . consult-line)
           ("C-c o" . consult-file-externally)
           ("C-c p f" . consult-ripgrep)
           (:map minibuffer-local-map
                 ("C-c h" . consult-history)
                 ("C-s" . #'previous-history-element)))
    :init
    (add-to-list 'exec-path "${pkgs.fd}/bin")
    (add-to-list 'exec-path "${pkgs.ripgrep}/bin")
    (defun idiig/consult-buffer-region-or-symbol ()
      "consult-line当前字符或选中区域."
      (interactive)
      (let ((input (if (region-active-p)
                       (buffer-substring-no-properties
                        (region-beginning) (region-end))
                     (thing-at-point 'symbol t))))
        (consult-line input)))
    (defun idiig/consult-project-region-or-symbol (&optional default-inputp)
      "consult-ripgrep 当前字符或选中区域."
      (interactive)
      (let ((input (if (region-active-p)
                       (buffer-substring-no-properties
                        (region-beginning) (region-end))
                     (thing-at-point 'symbol t))))
        (consult-ripgrep default-inputp input)))
    :config
    (progn
      ;; (defvar my-consult-line-map
      ;;   (let ((map (make-sparse-keymap)))
      ;;     (define-key map "C-s" #'previous-history-element)
      ;;     map))
      ;; (consult-customize consult-line :keymap my-consult-line-map)
      ;; ;; 禁止自动显示consult文件的内容
      (setq consult-preview-key "C-v")
      ;; 应用 Orderless 的正则解析到 consult-grep/ripgrep/find
      (defun consult--orderless-regexp-compiler (input type &rest _config)
        (setq input (orderless-pattern-compiler input))
        (cons
         (mapcar (lambda (r) (consult--convert-regexp r type)) input)
         (lambda (str) (orderless--highlight input str))))
      ;; 表示的buffer种类
      (defcustom consult-buffer-sources
        '(consult--source-hidden-buffer
          consult--source-buffer
          consult--source-file
          consult--source-bookmark
          consult--source-project-buffer
          consult--source-project-file)
        "Sources used by `consult-buffer'. See `consult--multi' for a description of the source values."
        :type '(repeat symbol))
      ;; ？提示检索buffer类型；f<SPC>=file, p<SPC>=project, etc..
      (define-key consult-narrow-map
  		(vconcat consult-narrow-key "?") #'consult-narrow-help)))
#+end_src

******* *Embark*: minibuffer action 和自适应的context menu
#+begin_src emacs-lisp
  (use-package embark
    :after vertico
    :bind
    (("C-h B" . embark-bindings)  ;; alternative for `describe-bindings'
     (:map minibuffer-local-map
           ("C-'" . embark-act)         ;; 对函数进行设置操作 
           ("M-." . embark-dwim)        ;; 实施 
           ("C-c C-e" . embark-export))) ;; occur 
    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  ;; embark-export弹出occur和grep mode的buffer
  (use-package embark-consult
    :ensure t
    :after (consult))
#+end_src
                
**** 撤销 (=vundo=)
我原来使用 undotree ，现在使用 vundo。这些用于视觉化撤销树。这里我之绑
定了 =C-x u= ， =C-/= 我依然用的原生的 Undo，这样适合区分使用。
***** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix 
  vundo
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package vundo
    :defer t
    :commands
    (vundo)
    :bind
    ("C-x u" . vundo))
#+end_src
**** 检索 (=ctrlf=)
针对当前 buffer 利用 =Ctrlf= 而不在使用 =swiper= 和 =helm= 这类型的检索方式。
用于替代 =isearch= 的 =C-s= 键。另外的选项是 =consult-line= ，我映射到了 =C-c
s= 键位，用于不移动当前位置预览检索行，尤其是在类似与 org 存在折叠的情
况下，我不需要移动光标和展开折叠。关于 =consult= ，可见[[**Consult*: 增强minibuffer的检索][*Consult*: 增强
minibuffer的检索]]。
***** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix 
  ctrlf
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
****** 启动 =ctrf=
#+begin_src emacs-lisp
  (require 'ctrlf)
  (ctrlf-mode +1)
#+end_src
****** 切换检索风格
#+begin_src emacs-lisp
  (with-eval-after-load 'ctrlf
    
    ;; 定义 advice 函数
    (defun ctrlf-set-default-style-advice (style)
      "Advice function to set the default search style when changing styles.
  This ensures the selected style becomes the new default for future sessions."
      (setq ctrlf-default-search-style style))
    
    ;; 添加 advice
    (advice-add 'ctrlf-change-search-style :after #'ctrlf-set-default-style-advice))
#+end_src
**** 重构 (=wgrep=)
在 =grep= , =ag=, =ripgrep= 等检索的结果中按下 =e= 进入编辑模式，按下 =C-c C-c=
完成修改。
***** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  wgrep
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package wgrep
    :config
    (setq wgrep-auto-save-buffer t)
    (setq wgrep-enable-key "e"))
#+end_src
