README.html
<li><a id="orga71a7f3"></a><b>Maginalia</b>: 增强minubuffer的annotation<br />
<div class="outline-text-8" id="text-5-2-3-11-2-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package marginalia
  :after vertico
  ;; 只在minibuffer启用快捷键
  :bind (:map minibuffer-local-map ("M-A" . marginalia-cycle))
  :init
  (setq marginalia-align-offset 5)
  :config
  (marginalia-mode))
</pre>
</div>
</div>
</li>
<li><a id="orgb37c536"></a><b>Consult</b>: 增强minibuffer的检索<br />
<div class="outline-text-8" id="text-5-2-3-11-2-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package consult
  :hook (after-init . (lambda () (require 'consult)))
  :bind (([remap M-x] . execute-extended-command)
         ([remap goto-line] . consult-goto-line)
         ([remap switch-to-buffer] . consult-buffer)
         ([remap find-file] . find-file)
         ([remap imenu] . consult-imenu)
         ("C-c r" . consult-recent-file)
         ("C-c y" . consult-yasnippet)
         ("C-c f" . consult-find)
         ("C-c s" . consult-line)
         ("C-c o" . consult-file-externally)
         ("C-c p f" . consult-ripgrep)
         (:map minibuffer-local-map
               ("C-c h" . consult-history)
               ("C-s" . #'previous-history-element)))
  :init
  (add-to-list 'exec-path "${pkgs.fd}/bin")
  (add-to-list 'exec-path "${pkgs.ripgrep}/bin")
  (defun idiig/consult-buffer-region-or-symbol ()
    "consult-line当前字符或选中区域."
    (interactive)
    (let ((input (if (region-active-p)
                     (buffer-substring-no-properties
                      (region-beginning) (region-end))
                   (thing-at-point 'symbol t))))
      (consult-line input)))
  (defun idiig/consult-project-region-or-symbol (&amp;optional default-inputp)
    "consult-ripgrep 当前字符或选中区域."
    (interactive)
    (let ((input (if (region-active-p)
                     (buffer-substring-no-properties
                      (region-beginning) (region-end))
                   (thing-at-point 'symbol t))))
      (consult-ripgrep default-inputp input)))
  :config
  (progn
    ;; (defvar my-consult-line-map
    ;;   (let ((map (make-sparse-keymap)))
    ;;     (define-key map "C-s" #'previous-history-element)
    ;;     map))
    ;; (consult-customize consult-line :keymap my-consult-line-map)
    ;; ;; 禁止自动显示consult文件的内容
    (setq consult-preview-key "C-v")
    ;; 应用 Orderless 的正则解析到 consult-grep/ripgrep/find
    (defun consult--orderless-regexp-compiler (input type &amp;rest _config)
      (setq input (orderless-pattern-compiler input))
      (cons
       (mapcar (lambda (r) (consult--convert-regexp r type)) input)
       (lambda (str) (orderless--highlight input str))))
    ;; 表示的buffer种类
    (defcustom consult-buffer-sources
      '(consult--source-hidden-buffer
        consult--source-buffer
        consult--source-file
        consult--source-bookmark
        consult--source-project-buffer
        consult--source-project-file)
      "Sources used by `consult-buffer'. See `consult--multi' for a description of the source values."
      :type '(repeat symbol))
    ;; ？提示检索buffer类型；f&lt;SPC&gt;=file, p&lt;SPC&gt;=project, etc..
    (define-key consult-narrow-map
                (vconcat consult-narrow-key "?") #'consult-narrow-help)))
</pre>
</div>
</div>
</li>
<li><a id="org8815613"></a><b>Embark</b>: minibuffer action 和自适应的context menu<br />
<div class="outline-text-8" id="text-5-2-3-11-2-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package embark
  :after vertico
  :bind
  (("C-h B" . embark-bindings)  ;; alternative for `describe-bindings'
   (:map minibuffer-local-map
         ("C-'" . embark-act)         ;; 对函数进行设置操作 
         ("M-." . embark-dwim)        ;; 实施 
         ("C-c C-e" . embark-export))) ;; occur 
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)
  :config
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

;; embark-export弹出occur和grep mode的buffer
(use-package embark-consult
  :ensure t
  :after (consult))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org24ac786"></a>撤销 (<code>vundo</code>)<br />
<div class="outline-text-5" id="text-5-2-3-12">
<p>
我原来使用 undotree ，现在使用 vundo。这些用于视觉化撤销树。这里我之绑定了 <code>C-x u</code> ， <code>C-/</code> 我依然用的原生的 Undo，这样适合区分使用。
</p>
</div>
<ol class="org-ol">
<li><a id="org7119b61"></a>依赖<br />
<div class="outline-text-6" id="text-5-2-3-12-1">
<div class="org-src-container">
<pre class="src src-nix">vundo
</pre>
</div>
</div>
</li>
<li><a id="org251c33a"></a>配置<br />
<div class="outline-text-6" id="text-5-2-3-12-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vundo
  :defer t
  :commands
  (vundo)
  :bind
  ("C-x u" . vundo))
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="org6d6e7d3"></a>检索 (<code>ctrlf</code>)<br />
<div class="outline-text-5" id="text-5-2-3-13">
<p>
针对当前 buffer 利用 <code>Ctrlf</code> 而不在使用 <code>swiper</code> 和 <code>helm</code> 这类型的检索方式。用于替代 <code>isearch</code> 的 <code>C-s</code> 键。另外的选项是 <code>consult-line</code> ，我映射到了 <code>C-c
s</code> 键位，用于不移动当前位置预览检索行，尤其是在类似与 org 存在折叠的情况下，我不需要移动光标和展开折叠。关于 <code>consult</code> ，可见<a href="#orgb37c536"><b>Consult</b>: 增强
minibuffer的检索</a>。
</p>
</div>
<ol class="org-ol">
<li><a id="org02f3bf7"></a>依赖<br />
<div class="outline-text-6" id="text-5-2-3-13-1">
<div class="org-src-container">
<pre class="src src-nix">ctrlf
</pre>
</div>
</div>
</li>
<li><a id="org0ef8c74"></a>配置<br />
<div class="outline-text-6" id="text-5-2-3-13-2">
</div>
<ol class="org-ol">
<li><a id="orgf9177a9"></a>启动 <code>ctrf</code><br />
<div class="outline-text-7" id="text-5-2-3-13-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'ctrlf)
(ctrlf-mode +1)
</pre>
</div>
</div>
</li>
<li><a id="org7623726"></a>切换检索风格<br />
<div class="outline-text-7" id="text-5-2-3-13-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'ctrlf

  ;; 定义 advice 函数
  (defun ctrlf-set-default-style-advice (style)
    "Advice function to set the default search style when changing styles.
This ensures the selected style becomes the new default for future sessions."
    (setq ctrlf-default-search-style style))

  ;; 添加 advice
  (advice-add 'ctrlf-change-search-style :after #'ctrlf-set-default-style-advice))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org0c392a2"></a>重构 (<code>wgrep</code>)<br />
<div class="outline-text-5" id="text-5-2-3-14">
<p>
在 <code>grep</code> , <code>ag</code>, <code>ripgrep</code> 等检索的结果中按下 <code>e</code> 进入编辑模式，按下 <code>C-c C-c</code>
完成修改。
</p>
</div>
<ol class="org-ol">
<li><a id="orgf7ba3ec"></a>依赖<br />
<div class="outline-text-6" id="text-5-2-3-14-1">
<div class="org-src-container">
<pre class="src src-nix">wgrep
</pre>
</div>
</div>
</li>
<li><a id="org083403b"></a>配置<br />
<div class="outline-text-6" id="text-5-2-3-14-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package wgrep
  :config
  (setq wgrep-auto-save-buffer t)
  (setq wgrep-enable-key "e"))
</pre>
</div>
</div>
</li>
</ol>
</li>
