README.org
**** 括号匹配
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package emacs
    :init
    ;; 启用自动括号配对
    (electric-pair-mode t)
    
    :config
    ;; 配置 electric-pair-mode 行为
    (setq electric-pair-preserve-balance nil)
    ;; 使用保守的抑制策略
    ;; https://www.reddit.com/r/emacs/comments/4xhxfw/how_to_tune_the_behavior_of_eletricpairmode/
    (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit)
    
    ;; 保存默认的配对括号设置，以便创建模式特定的本地设置
    (defconst idiig/default-electric-pairs electric-pair-pairs)
    
    ;; 为特定模式添加本地电子配对
    (defun idiig/add-local-electric-pairs (pairs)
      "为当前缓冲区添加本地电子配对括号。
       
       参数:
         PAIRS: 要添加的括号对列表
       
       示例用法:
         (add-hook 'jupyter-org-interaction-mode-hook
                   (lambda () (idiig/add-local-electric-pairs '((?$ . ?$)))))"
      (setq-local electric-pair-pairs (append idiig/default-electric-pairs pairs))
      (setq-local electric-pair-text-pairs electric-pair-pairs))
    
    ;; 禁止自动配对尖括号 <>
    (add-function :before-until electric-pair-inhibit-predicate
                  (lambda (c) (eq c ?<)))
    
    ;; 增强的括号匹配高亮——即使光标在括号内也能高亮匹配的括号
    (define-advice show-paren-function (:around (fn) fix-show-paren-function)
      "即使光标不直接位于括号上，也能高亮匹配的括号。"
      (cond ((looking-at-p "\\s(") (funcall fn))
            (t (save-excursion
                 (ignore-errors (backward-up-list))
                 (funcall fn)))))
    
    ;; 启用括号匹配高亮
    (show-paren-mode t))
#+end_src

**** 语言无关的结构化编程 (=puni=)
***** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  puni
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp :noweb yes
  (use-package puni
    :defer t
    :bind
    (:map puni-mode-map
    	([remap puni-kill-line] . idiig/puni-kill-line)
    	("C--" . idiig/puni-contract-region)
    	("C-=" . puni-expand-region))
    :init
    ;; The autoloads of Puni are set up so you can enable `puni-mode` or
    ;; `puni-global-mode` before `puni` is actually loaded. Only after you press
    ;; any key that calls Puni commands, it's loaded.
    (puni-global-mode)
    (add-hook 'term-mode-hook #'puni-disable-puni-mode)
    :config
    <<idiig/puni-kill-line>>
    <<idiig/puni-contract-region>>
    <<idiig/puni-expand-region-advice>>
  )
#+end_src
****** =puni-kill-line=
基于 =puni= 更改 =kill-line= ，在删除行的时候可以确认是否被包围在某个环境
中。如果被包围在某个环境中则删除到该环境的最后，如果没有则正常执行
=kill-line= 。
#+begin_src emacs-lisp :noweb-ref idiig/puni-kill-line
  (defun idiig/puni-kill-line (&optional n)
    "Kill a line forward while keeping expressions balanced.
  If forward kill is not possible, try backward. If still nothing
  can be deleted, kill the balanced expression around point."
    (interactive "p")
    (let ((bounds (puni-bounds-of-list-around-point)))
      (cond
       ;; Case 1: No list bounds found, try deleting surrounding sexp
       ((null bounds)
        (when-let ((sexp-bounds (puni-bounds-of-sexp-around-point)))
          (puni-delete-region (car sexp-bounds) (cdr sexp-bounds) 'kill)))

       ;; Case 2: Point is at end of bounds, try backward kill
       ((eq (point) (cdr bounds))
        (puni-backward-kill-line))

       ;; Case 3: Default forward kill
       (t
        (puni-kill-line n)))))
#+end_src
****** =idiig/puni-contract-region=
如无选中则保持 negative-argument,如有选中则缩小范围
#+begin_src emacs-lisp  :noweb-ref idiig/puni-contract-region 
  (defun idiig/puni-contract-region (&optional arg)
    "如无选中则保持 negative-argument,如有选中则缩小范围"
    (interactive "p")
    (if (region-active-p)
        (call-interactively #'puni-contract-region)
      (negative-argument arg)))
#+end_src

#+begin_src emacs-lisp
  ;; 添加 advice
  (with-eval-after-load 'puni
    (defun idiig/puni-expand-region-advice (orig-fun &rest args)
      "使用选中后的操作"
      
      (let* ((ev last-command-event)
             (echo-keystrokes nil))
        ;; 执行初始调整
        (apply orig-fun args)

        ;; 设置 transient map
        (let ((delta (car args))) 
  	(set-transient-map
  	 (let ((map (make-sparse-keymap)))
             ;; 持续扩大
             (define-key map (kbd "=") 'puni-expand-region)
             ;; 缩小范围
             (define-key map (kbd "-") 'puni-contract-region)
  	   ;; 其他操作
  	   ;; 检索
             (define-key map (kbd "/") 'idiig/consult-project-region-or-symbol)
             (define-key map (kbd "b") 'idiig/consult-buffer-region-or-symbol)
  	   ;; 加包围
  	   (define-key map (kbd ")") 'puni-wrap-round)
             (define-key map (kbd "]") 'puni-wrap-square)
  	   (define-key map (kbd "}") 'puni-wrap-curly)
  	   (define-key map (kbd ">") 'puni-wrap-angle)
  	   map)
  	 nil nil
  	 "Use %k for further adjustment"))))
    (advice-add 'puni-expand-region :around #'idiig/puni-expand-region-advice))
#+end_src
**** 覆盖 =<Backspace>= 和 =<DEL>= 等删除动作
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
***** =backward-hungry-delete=
向后删除时向后贪婪地删除连续的空白值。同时考虑对称的结构。
- 首先检查光标前面是否有连续的空白字符。
- 使用 =looking-back= 用于判断满足以下任何一个条件：
  - 光标之前在当前行是否有符合正则表达式 =(+ blank)= 的字符序列。
  - 光标是否在行首 =(bolp)= 。
- 如果有连续的空白字符或在行首：
  - 使用 =skip-chars-backward= 向后跳过这些字符，并记录开始位置 =start= 。
  - 然后 =delete-region= 用于删除从 =start= 到当前光标位置之间的字符。
#+begin_src emacs-lisp
  (defun idiig/backward-hungry-delete-advice (orig-fun &rest args)
    "Advice function to provide hungry delete functionality."
    (if (or (looking-back (rx (+ blank))) (bolp))
        (let ((start (save-excursion (skip-chars-backward " \t\f\n\r\v") (point))))
          (delete-region start (point)))
      (apply orig-fun args)))

  (defun idiig/apply-backward-hungry-delete-advice ()
    "Reapply the hungry delete advice to the current DEL key binding function."
    (let ((current-fun (key-binding (kbd "DEL"))))
      (advice-remove current-fun #'idiig/backward-hungry-delete-advice)    ; 移除旧的 advice
      (advice-add current-fun :around #'idiig/backward-hungry-delete-advice))) ; 应用新的 advice

  ;; 在 emacs-startup 时应用 advice
  (add-hook 'emacs-startup-hook #'idiig/apply-backward-hungry-delete-advice)

  ;; 如果你有其他 hook 如打开某种模式时，需要重新应用 advice，可添加对应 hook，例如：
  ;; (add-hook 'your-major-mode-hook #'idiig/reapply-backward-hungry-delete-advice)
#+end_src
