README.org
***** =forward-hungry-delete=
向前删除时向前贪婪地删除连续的空白值。同时考虑对称的结构。
- 检查光标后的字符：
  - 使用 =looking-at= 判断光标后面的字符是否是一个或多个空白字符或换行符。
  - 如果匹配到，使用 =skip-chars-forward= 跳过所有这些字符并记录结束位置。
  - 使用 =delete-region= 删除从当前光标位置到记录的结束位置之间的所有空白。
- 字符删除逻辑：
  - 如果光标后没有多余的空白字符，使用 =dotimes= 循环和 =puni-forward-delete-char= 删除 =n= 个普通字符。
  - =unless (eobp)=: 确保在没有到达缓冲区末尾时进行字符删除，防止出现试图超出缓冲区范围的错误。
#+begin_src emacs-lisp
  (defun idiig/forward-hungry-delete-advice (orig-fun &rest args)
    "Advice function to provide forward hungry delete functionality."
    (if (looking-at (rx (or (1+ blank) "\n")))
        (let ((end (save-excursion
                     (skip-chars-forward " \t\f\v\n\r")
                     (point))))
          (delete-region (point) end))
      (apply orig-fun args)))

  (defun idiig/apply-forward-hungry-delete-advice ()
    "Apply the forward hungry delete advice to the current forward delete key binding function."
    (let ((current-fun (key-binding (kbd "C-d"))))
      (advice-remove current-fun #'idiig/forward-hungry-delete-advice) ; 移除旧的 advice
      (advice-add current-fun :around #'idiig/forward-hungry-delete-advice))) ; 应用新的 advice

  ;; 在 emacs-startup 时应用 advice
  (add-hook 'emacs-startup-hook #'idiig/apply-forward-hungry-delete-advice)

  ;; 如果你有其他 hook 需要重新应用 advice，可添加对应 hook，例如：
  ;; (add-hook 'your-major-mode-hook #'idiig/apply-forward-hungry-delete-advice)
#+end_src
***** =backward-kill-word-or-region=
如无选中则杀掉前面的单词，如有选中则杀掉选中区域。
#+begin_src emacs-lisp
  (defun idiig/backward-kill-word-or-region-advice (orig-fun &rest args)
    "Enhance the C-w function to handle region more flexibly."
    (if (region-active-p)
        ;; 当有选中区域时，使用传递的参数调用原始C-w功能（例如 `puni-kill-region`）
        (apply orig-fun args)
      ;; 当没有选中区域时，执行删除单词操作
      (let ((backward-kill-word-fun (or (key-binding (kbd "M-<DEL>"))
                                        (key-binding (kbd "S-<delete>"))
                                        'backward-kill-word))) ; 默认删除单词函数
        (if (fboundp backward-kill-word-fun)
            (call-interactively backward-kill-word-fun) ; 交互式调用删除单词
          (message "No word kill bound function found for M-<DEL> or S-<delete>")))))

  (defun idiig/apply-backward-kill-word-or-region-advice ()
    "Advice C-w to optionally kill region or word."
    ;; 通过 `key-binding` 得到当前与 C-w 绑定的函数
    (let ((current-fun (key-binding (kbd "C-w"))))
      (advice-remove current-fun #'idiig/backward-kill-word-or-region-advice)
      (advice-add current-fun :around #'idiig/backward-kill-word-or-region-advice)))

  ;; 在 emacs 启动时应用这个 advice
  (add-hook 'emacs-startup-hook #'idiig/apply-backward-kill-word-or-region-advice)
#+end_src
** CJK字体
这里我统一使用的是Sarasa的等宽字体，可以避免2个问题：
- 输入latin以后输入cjk文字以后，由于字体高度不等导致行高抖动
- 方便org等表格等宽表示
*** 依赖
:PROPERTIES:
:header-args: :noweb-ref sys-path
:END:
#+begin_src sh
  if [ "$(uname)" = "Darwin" ]; then
      # macOS
      mkdir -p "$HOME/Library/Fonts/"
      ${pkgs.rsync}/bin/rsync -av ${pkgs.sarasa-gothic}/share/fonts/truetype/ "$HOME/Library/Fonts/"
  else
      # Assume Linux
      mkdir -p "$HOME/.local/share/fonts/truetype/"
      ${pkgs.rsync}/bin/rsync -av ${pkgs.sarasa-gothic}/share/fonts/truetype/ "$HOME/.local/share/fonts/sarasa-gothic/"
      fc-cache -f -v ~/.local/share/fonts/
  fi
#+end_src

*** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (add-hook 'after-init-hook
  	  (lambda ()
  	    (let* ((screen-height (display-pixel-height))
  		   (font-height (if (> screen-height 1200) 230 130))  ;; 根据屏幕高度调整
  		   (minibuffer-font-height (- font-height 0))
  		   (my-font "Sarasa Mono SC"))
  	      (set-face-attribute 'default nil :family my-font :height font-height)
  	      ;; 设置 mode-line 字体
  	      (set-face-attribute 'mode-line nil :family my-font :height font-height)
  	      (set-face-attribute 'mode-line-inactive nil :family my-font :height font-height)
  	      ;; 设置 minibuffer 字体
  	      (set-face-attribute 'minibuffer-prompt nil :family my-font :height minibuffer-font-height))))

  ;; 工具栏，菜单保持默认字体
  (set-face-attribute 'menu nil :inherit 'unspecified)
  (set-face-attribute 'tool-bar nil :inherit 'unspecified)
#+end_src

** 日文
*** 输入法 (ddskk)
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+BEGIN_SRC nix 
  ddskk
#+END_SRC

**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package ddskk
    :defer t
    :bind (("C-x j" . skk-mode))
    :config
    (setq skk-server-inhibit-startup-server nil)
    (setq skk-server-host "localhost")
    (setq skk-server-portnum 55100)
    (setq skk-share-private-jisyo t)

    ;; 候补显示设置
    (setq skk-show-inline t)
    (setq skk-show-tooltip t)
    (setq skk-show-candidates-always-pop-to-buffer t)
    (setq skk-henkan-show-candidates-rows 2)

    ;; 行为设置
    (setq skk-egg-like-newline t)
    (setq skk-delete-implies-kakutei nil)
    (setq skk-use-look t)
    (setq skk-auto-insert-paren t)
    (setq skk-henkan-strict-okuri-precedence t)

    ;; 片假名转换设置
    (setq skk-search-katakana 'jisx0201-kana)

    ;; 加载额外功能
    (require 'skk-hint)
    :hook
    (skk-load . (lambda ()
                  (require 'context-skk))))
#+end_src

*** 检索（Migemo）
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  migemo
#+end_src
注意这里使用的是 =cmigemo= 。
**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
***** 基础配置
#+begin_src emacs-lisp
  (require 'migemo)
  ;; cmigemo(default)
  (setq migemo-command "${pkgs.cmigemo}/bin/cmigemo")
  (setq migemo-options '("-q" "--emacs"))

  ;; Set your installed path
  (setq migemo-dictionary "${pkgs.cmigemo}/share/migemo/utf-8/migemo-dict")

  (setq migemo-user-dictionary nil)
  (setq migemo-regex-dictionary nil)
  (when (and migemo-command migemo-dictionary)
    (migemo-init)
    (message "Migemo initialized with dictionary: %s" migemo-dictionary))
#+end_src
***** buffer内字符检索 (=Ctrlf=) 交互
#+begin_src emacs-lisp
  (with-eval-after-load 'migemo
    (with-eval-after-load 'ctrlf
      (add-to-list 'ctrlf-style-alist '(migemo-regexp . (:prompt "migemo-regexp"
  							       :translator migemo-search-pattern-get
  							       :case-fold ctrlf-no-uppercase-regexp-p)))))

#+end_src
***** minibuffer内检索 (=Orderless=) 交互
用 =migemo= 在minibuffer的检索中用 =#= 前缀可开启罗马字检索日语。
#+begin_src emacs-lisp
  (with-eval-after-load 'orderless
    (defun orderless-migemo (component)
    (let ((pattern (migemo-get-pattern component)))
      (condition-case nil
          (progn (string-match-p pattern "") pattern)
        (invalid-regexp nil))))
    
    (add-to-list '+orderless-dispatch-alist '(?# . orderless-migemo)))
#+end_src
** 中文
