README.org
*** 输入法和基于输入法的检索 (pyim)
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+BEGIN_SRC nix 
  pyim
    pyim-basedict
#+END_SRC
**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
***** 基础配置
#+begin_src emacs-lisp
  (use-package pyim
    :diminish pyim-isearch-mode
    :commands
    (toggle-input-method)
    :custom
    (default-input-method "pyim")
    (pyim-dcache-directory (concat user-emacs-directory "pyim/dcache"))
    (pyim-default-scheme 'quanpin)
    (pyim-page-tooltip 'popup)
    (pyim-page-length 4))

  ;; 加载并启用基础词库
  (use-package pyim-basedict
    :after pyim
    :config
    (pyim-basedict-enable))
#+end_src
***** TODO 正则表达交互
目前支持：
- 在minibuffer中用 =C-Ret= 把单字拼音转换为该读音本身代表的中文正则表达
- =M-x idiig/toggle-pyim-region= 用于开关中文的forward-word和backward
- 激活进入pyim时，自动开启中文的forward和backward
#+begin_src emacs-lisp
  (with-eval-after-load 'pyim
    (require 'pyim-cstring-utils)

    ;; C-return 把当前选中的位置转换为正则表达
    (define-key minibuffer-local-map (kbd "C-<return>") 'pyim-cregexp-convert-at-point)

    (defvar idiig/pyim-region-enabled nil
      "记录pyim区域功能是否启用的状态变量。")

    (defun idiig/toggle-pyim-region ()
      "切换pyim的单词移动功能。
  当启用时，会将forward-word和backward-word重映射为pyim的相应函数；
  当禁用时，会恢复原来的映射。"
      (interactive)
      (if idiig/pyim-region-enabled
  	(progn
  	  (idiig/disable-pyim-region)
  	  (setq idiig/pyim-region-enabled nil)
  	  (message "已禁用pyim区域功能"))
        (progn
  	(idiig/enable-pyim-region)
  	(setq idiig/pyim-region-enabled t)
  	(message "已启用pyim区域功能"))))

    (defun idiig/enable-pyim-region (&rest _)
      "启用pyim的单词移动建议。"
      (global-set-key [remap forward-word] 'pyim-forward-word)
      (global-set-key [remap backward-word] 'pyim-backward-word))

    (defun idiig/disable-pyim-region (&rest _)
      "禁用pyim的单词移动建议。"
      (global-unset-key [remap forward-word])
      (global-unset-key [remap backward-word]))

    ;; ;; 挂钩到 pyim 的启用/禁用钩子上
    ;; (advice-remove 'pyim-deactivate #'idiig/disable-pyim-region)
    ;; (advice-remove 'pyim-activate #'idiig/enable-pyim-region)
    ;; (advice-add 'pyim-deactivate :after #'idiig/disable-pyim-region)
    (advice-add 'pyim-activate :after #'idiig/enable-pyim-region))
#+end_src

***** buffer内检索 (=Ctrlf=) 交互
这里我写了一个函数 =pyim-cregex-build-lazy= 。这个函数交互 =pyim= 。参见输
入法。这个函数的工作逻辑如下：

- 如果还没有初始化拼音数据，就先进行预热预热时会加载 "a"、"e"、"o" 这
  三个字符的拼音映射数据设置初始化标志，避免重复初始化
- 接着分两种情况处理：
  1. 情况1 :: 单个字符且不是 a/e/o，双个字母不是 zh/ch/sh
     1) 使用 regexp-quote 直接转义字符
     2) 例如：输入 "b" → 直接匹配字符 "b"
     3) 避免触发拼音转换，提高性能
  2. 情况2 :: 其他所有情况
     1) 使用 pyim-cregexp-build 进行拼音转换，包括：
        + 单个字符 "a"、"e"、"o"（常用韵母）
        + 多个字符组合（如 "zh"、"zhong"）
- 设计目的
  1. 性能优化 :: 避免输入大多数单个字符时的拼音转换开销
  2. 保持功能 :: 在需要拼音搜索时正常工作
  3. 用户体验 :: 减少首次输入时的卡顿感
    
#+begin_src emacs-lisp
  (with-eval-after-load 'ctrlf
    
    (defvar pyim-ctrlf-initialized nil
      "Flag to track if pyim data has been initialized for ctrlf.")
    
    (defvar pyim-ctrlf-cache (make-hash-table :test 'equal)
      "Cache for pyim-cregexp-build results.")
    
    (defconst pyim-ctrlf-vowels-with-mapping '("a" "e" "o")
      "Vowels that have direct Chinese character mappings.")
    
    (defconst pyim-ctrlf-double-consonants '("zh" "ch" "sh")
      "Double-letter consonants that should use regex-quote for exact matching.")
    
    (defun pyim-cregexp-build-lazy (str)
      "Lazy wrapper for pyim-cregexp-build with caching."
      (unless pyim-ctrlf-initialized
        (message "Initializing pyim data for ctrlf...")
        ;; 预缓存常用字符的结果
        (call-interactively #'pyim-activate)
        (call-interactively #'pyim-deactivate)
        
        (dolist (vowel pyim-ctrlf-vowels-with-mapping)
          (let ((result (pyim-cregexp-build vowel)))
            (puthash vowel result pyim-ctrlf-cache)))
        (setq pyim-ctrlf-initialized t)
        (message "Pyim data initialized."))
      
      ;; 判断是否使用 regex-quote
      (if (or (and (= (length str) 1)
                   (not (member str pyim-ctrlf-vowels-with-mapping)))
              (member str pyim-ctrlf-double-consonants))
          (regexp-quote str)
        ;; 使用缓存或计算新结果
        (or (gethash str pyim-ctrlf-cache)
            (let ((result (pyim-cregexp-build str)))
              (puthash str result pyim-ctrlf-cache)
              result))))

    (add-to-list 'ctrlf-style-alist
                 '(pinyin-regexp . (:prompt "pinyin-regexp"
  					  :translator pyim-cregexp-build-lazy
  					  :case-fold ctrlf-no-uppercase-regexp-p
  					  :fallback (isearch-forward-regexp
  						     . isearch-backward-regexp)))))
#+end_src
***** minibuffer内检索 (=Orderless=) 交互
用 =pyim= 在minibuffer的检索中用 =◎= 前缀可开启拼音检索中文。
#+begin_src emacs-lisp
  ;; (with-eval-after-load 'orderless
  ;;   ;; 拼音检索字符串功能
  ;;   (defun zh-orderless-regexp (orig_func component)
  ;;     (call-interactively #'pyim-activate)
  ;;     (call-interactively #'pyim-deactivate)
  ;;     (let ((result (funcall orig_func component)))
  ;;       (pyim-cregexp-build result)))
  ;;   (advice-add 'orderless-regexp :around #'zh-orderless-regexp))

  (with-eval-after-load 'orderless

    (defvar pyim-orderless-initialized nil
      "Flag to track if pyim data has been initialized for orderless.")

    (defun orderless-pyim (component)
      (unless pyim-orderless-initialized
        (message "Initializing pyim for orderless...")
        ;; 预缓存常用字符的结果
        (call-interactively #'pyim-activate)
        (call-interactively #'pyim-deactivate)
        (setq pyim-orderless-initialized t)
        (message "Pyim data initialized."))
      
      (let ((pattern (pyim-cregexp-build component)))
        (condition-case nil
            (progn (string-match-p pattern "") pattern)
  	(invalid-regexp nil))))

    (add-to-list '+orderless-dispatch-alist '(?@ . orderless-pyim)))
#+end_src
** Git (=magit=)
用 Magit 进行项目与版本的管理
*** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:

#+BEGIN_SRC nix
  magit
#+END_SRC

*** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:

**** Magit

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :bind ("C-x g" . magit-status)
    :commands magit-status
    :init
    ;; 使用nix路径中的git
    (add-to-list 'exec-path "${pkgs.git}/bin"))
#+END_SRC

** 文档写作
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
*** 文档后缀
#+begin_src emacs-lisp
  (defvar idiig/writing-environment-list '("\\.org\\'"
                                           "\\.md\\'"
                                           "\\.qmd\\'"
                                           "\\.rmd\\'"
                                           "\\.typ\\'"
                                           "\\.tex\\'"
                                           "\\.bib\\'"
                                           "\\.txt\\'"))
#+end_src

