README.html
<div id="outline-container-org10f36e4" class="outline-3">
<h3 id="org10f36e4"><span class="section-number-3">5.5.</span> 中文</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-org83decea" class="outline-4">
<h4 id="org83decea"><span class="section-number-4">5.5.1.</span> 输入法和基于输入法的检索 (pyim)</h4>
<div class="outline-text-4" id="text-5-5-1">
</div>
<ol class="org-ol">
<li><a id="org2237c57"></a>依赖<br />
<div class="outline-text-5" id="text-5-5-1-1">
<div class="org-src-container">
<pre class="src src-nix">pyim
  pyim-basedict
</pre>
</div>
</div>
</li>
<li><a id="org7dafc45"></a>配置<br />
<div class="outline-text-5" id="text-5-5-1-2">
</div>
<ol class="org-ol">
<li><a id="org2fc4423"></a>基础配置<br />
<div class="outline-text-6" id="text-5-5-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package pyim
  :diminish pyim-isearch-mode
  :commands
  (toggle-input-method)
  :custom
  (default-input-method "pyim")
  (pyim-dcache-directory (concat user-emacs-directory "pyim/dcache"))
  (pyim-default-scheme 'quanpin)
  (pyim-page-tooltip 'popup)
  (pyim-page-length 4))

;; 加载并启用基础词库
(use-package pyim-basedict
  :after pyim
  :config
  (pyim-basedict-enable))
</pre>
</div>
</div>
</li>
<li><a id="org7b9c92a"></a><span class="todo TODO">TODO</span> 正则表达交互<br />
<div class="outline-text-6" id="text-5-5-1-2-2">
<p>
目前支持：
</p>
<ul class="org-ul">
<li>在minibuffer中用 <code>C-Ret</code> 把单字拼音转换为该读音本身代表的中文正则表达</li>
<li><code>M-x idiig/toggle-pyim-region</code> 用于开关中文的forward-word和backward</li>
<li>激活进入pyim时，自动开启中文的forward和backward</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'pyim
  (require 'pyim-cstring-utils)

  ;; C-return 把当前选中的位置转换为正则表达
  (define-key minibuffer-local-map (kbd "C-&lt;return&gt;") 'pyim-cregexp-convert-at-point)

  (defvar idiig/pyim-region-enabled nil
    "记录pyim区域功能是否启用的状态变量。")

  (defun idiig/toggle-pyim-region ()
    "切换pyim的单词移动功能。
当启用时，会将forward-word和backward-word重映射为pyim的相应函数；
当禁用时，会恢复原来的映射。"
    (interactive)
    (if idiig/pyim-region-enabled
        (progn
          (idiig/disable-pyim-region)
          (setq idiig/pyim-region-enabled nil)
          (message "已禁用pyim区域功能"))
      (progn
        (idiig/enable-pyim-region)
        (setq idiig/pyim-region-enabled t)
        (message "已启用pyim区域功能"))))

  (defun idiig/enable-pyim-region (&amp;rest _)
    "启用pyim的单词移动建议。"
    (global-set-key [remap forward-word] 'pyim-forward-word)
    (global-set-key [remap backward-word] 'pyim-backward-word))

  (defun idiig/disable-pyim-region (&amp;rest _)
    "禁用pyim的单词移动建议。"
    (global-unset-key [remap forward-word])
    (global-unset-key [remap backward-word]))

  ;; ;; 挂钩到 pyim 的启用/禁用钩子上
  ;; (advice-remove 'pyim-deactivate #'idiig/disable-pyim-region)
  ;; (advice-remove 'pyim-activate #'idiig/enable-pyim-region)
  ;; (advice-add 'pyim-deactivate :after #'idiig/disable-pyim-region)
  (advice-add 'pyim-activate :after #'idiig/enable-pyim-region))
</pre>
</div>
</div>
</li>
<li><a id="orge8724ea"></a>buffer内检索 (<code>Ctrlf</code>) 交互<br />
<div class="outline-text-6" id="text-5-5-1-2-3">
<p>
这里我写了一个函数 <code>pyim-cregex-build-lazy</code> 。这个函数交互 <code>pyim</code> 。参见输入法。这个函数的工作逻辑如下：
</p>

<ul class="org-ul">
<li>如果还没有初始化拼音数据，就先进行预热预热时会加载 "a"、"e"、"o" 这三个字符的拼音映射数据设置初始化标志，避免重复初始化</li>
<li>接着分两种情况处理：
<ol class="org-ol">
<li>情况1 :: 单个字符且不是 a/e/o，双个字母不是 zh/ch/sh
<ol class="org-ol">
<li>使用 regexp-quote 直接转义字符</li>
<li>例如：输入 "b" → 直接匹配字符 "b"</li>
<li>避免触发拼音转换，提高性能</li>
</ol></li>
<li>情况2 :: 其他所有情况
<ol class="org-ol">
<li>使用 pyim-cregexp-build 进行拼音转换，包括：
<ul class="org-ul">
<li>单个字符 "a"、"e"、"o"（常用韵母）</li>
<li>多个字符组合（如 "zh"、"zhong"）</li>
</ul></li>
</ol></li>
</ol></li>
<li>设计目的
<ol class="org-ol">
<li>性能优化 :: 避免输入大多数单个字符时的拼音转换开销</li>
<li>保持功能 :: 在需要拼音搜索时正常工作</li>
<li>用户体验 :: 减少首次输入时的卡顿感</li>
</ol></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'ctrlf

  (defvar pyim-ctrlf-initialized nil
    "Flag to track if pyim data has been initialized for ctrlf.")

  (defvar pyim-ctrlf-cache (make-hash-table :test 'equal)
    "Cache for pyim-cregexp-build results.")

  (defconst pyim-ctrlf-vowels-with-mapping '("a" "e" "o")
    "Vowels that have direct Chinese character mappings.")

  (defconst pyim-ctrlf-double-consonants '("zh" "ch" "sh")
    "Double-letter consonants that should use regex-quote for exact matching.")

  (defun pyim-cregexp-build-lazy (str)
    "Lazy wrapper for pyim-cregexp-build with caching."
    (unless pyim-ctrlf-initialized
      (message "Initializing pyim data for ctrlf...")
      ;; 预缓存常用字符的结果
      (call-interactively #'pyim-activate)
      (call-interactively #'pyim-deactivate)

      (dolist (vowel pyim-ctrlf-vowels-with-mapping)
        (let ((result (pyim-cregexp-build vowel)))
          (puthash vowel result pyim-ctrlf-cache)))
      (setq pyim-ctrlf-initialized t)
      (message "Pyim data initialized."))

    ;; 判断是否使用 regex-quote
    (if (or (and (= (length str) 1)
                 (not (member str pyim-ctrlf-vowels-with-mapping)))
            (member str pyim-ctrlf-double-consonants))
        (regexp-quote str)
      ;; 使用缓存或计算新结果
      (or (gethash str pyim-ctrlf-cache)
          (let ((result (pyim-cregexp-build str)))
            (puthash str result pyim-ctrlf-cache)
            result))))

  (add-to-list 'ctrlf-style-alist
               '(pinyin-regexp . (:prompt "pinyin-regexp"
                                          :translator pyim-cregexp-build-lazy
                                          :case-fold ctrlf-no-uppercase-regexp-p
                                          :fallback (isearch-forward-regexp
                                                     . isearch-backward-regexp)))))
</pre>
</div>
</div>
</li>
<li><a id="org311c041"></a>minibuffer内检索 (<code>Orderless</code>) 交互<br />
<div class="outline-text-6" id="text-5-5-1-2-4">
<p>
用 <code>pyim</code> 在minibuffer的检索中用 <code>◎</code> 前缀可开启拼音检索中文。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (with-eval-after-load 'orderless
;;   ;; 拼音检索字符串功能
;;   (defun zh-orderless-regexp (orig_func component)
;;     (call-interactively #'pyim-activate)
;;     (call-interactively #'pyim-deactivate)
;;     (let ((result (funcall orig_func component)))
;;       (pyim-cregexp-build result)))
;;   (advice-add 'orderless-regexp :around #'zh-orderless-regexp))

(with-eval-after-load 'orderless

  (defvar pyim-orderless-initialized nil
    "Flag to track if pyim data has been initialized for orderless.")

  (defun orderless-pyim (component)
    (unless pyim-orderless-initialized
      (message "Initializing pyim for orderless...")
      ;; 预缓存常用字符的结果
      (call-interactively #'pyim-activate)
      (call-interactively #'pyim-deactivate)
      (setq pyim-orderless-initialized t)
      (message "Pyim data initialized."))

    (let ((pattern (pyim-cregexp-build component)))
      (condition-case nil
          (progn (string-match-p pattern "") pattern)
        (invalid-regexp nil))))

  (add-to-list '+orderless-dispatch-alist '(?@ . orderless-pyim)))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org947df27" class="outline-3">
<h3 id="org947df27"><span class="section-number-3">5.6.</span> Git (<code>magit</code>)</h3>
<div class="outline-text-3" id="text-5-6">
<p>
用 Magit 进行项目与版本的管理
</p>
</div>
<div id="outline-container-org9675fbd" class="outline-4">
<h4 id="org9675fbd"><span class="section-number-4">5.6.1.</span> 依赖</h4>
<div class="outline-text-4" id="text-5-6-1">
<div class="org-src-container">
<pre class="src src-nix">magit
</pre>
</div>
</div>
</div>
<div id="outline-container-org3ca0ec2" class="outline-4">
<h4 id="org3ca0ec2"><span class="section-number-4">5.6.2.</span> 配置</h4>
<div class="outline-text-4" id="text-5-6-2">
</div>
<ol class="org-ol">
<li><a id="orgad4c361"></a>Magit<br />
<div class="outline-text-5" id="text-5-6-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package magit
  :bind ("C-x g" . magit-status)
  :commands magit-status
  :init
  ;; 使用nix路径中的git
  (add-to-list 'exec-path "${pkgs.git}/bin"))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgda5335d" class="outline-3">
<h3 id="orgda5335d"><span class="section-number-3">5.7.</span> 文档写作</h3>
<div class="outline-text-3" id="text-5-7">
</div>
<div id="outline-container-orgb19906d" class="outline-4">
<h4 id="orgb19906d"><span class="section-number-4">5.7.1.</span> 文档后缀</h4>
<div class="outline-text-4" id="text-5-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar idiig/writing-environment-list '("\\.org\\'"
                                         "\\.md\\'"
                                         "\\.qmd\\'"
                                         "\\.rmd\\'"
                                         "\\.typ\\'"
                                         "\\.tex\\'"
                                         "\\.bib\\'"
                                         "\\.txt\\'"))
</pre>
</div>
</div>
</div>
