README.org
*** 文档状态折行
#+begin_src emacs-lisp
  (defun idiig/in-writing-environment-p ()
    "Check if current buffer file matches any pattern in idiig/writing-environment-list."
    (when (buffer-file-name)
      (cl-some (lambda (pattern)
                 (string-match-p pattern (buffer-file-name)))
               idiig/writing-environment-list)))

  (add-hook 'find-file-hook
            (lambda ()
              (when (idiig/in-writing-environment-p)
                (visual-line-mode 1))))

  (with-eval-after-load 'diminish
    (diminish 'visual-line-mode))
#+end_src

*** 在选中区域的状态下 =C-w= 删除选中的区域
在没选中的状态下删除上一个单词。
#+begin_src emacs-lisp
  (with-eval-after-load 'puni
    (defun idiig/backward-kill-word-or-region (&optional arg)
      (interactive "p")
      (if (region-active-p)
  	(call-interactively #'puni-kill-active-region)
        (backward-kill-word arg)))

    (global-set-key (kbd "C-w") 'idiig/backward-kill-word-or-region))
#+end_src

*** =C-M-\= 全局缩进
#+begin_src emacs-lisp
  (defun idiig/indent-buffer()
    (interactive)
    (indent-region (point-min) (point-max)))

  (defun idiig/indent-region-or-buffer()
    (interactive)
    (save-excursion
      (if (region-active-p)
          (progn
            (indent-region (region-beginning) (region-end)))
        (progn
          (idiig/indent-buffer)))))

  (global-set-key (kbd "C-M-\\") 'idiig/indent-region-or-buffer)
  (global-set-key (kbd "C-M-¥") 'idiig/indent-region-or-buffer)  ;; JIS keyboard
#+end_src

*** =Shift-Ret= 下方插入空白行
#+begin_src emacs-lisp
  (global-set-key [(shift return)] 'idiig/smart-open-line)
#+end_src

*** =M--= 匹配到括号
TODO: 把 evil-jump-item 换成别的函数。
#+begin_src emacs-lisp
  (defun idiig/goto-match-paren (arg)
    "Go to the matching if on (){}[], similar to vi style of % "
    (interactive "p")
    ;; first, check for "outside of bracket" positions expected by forward-sexp, etc
    (cond ((looking-at "[\[\(\{]") (evil-jump-item))
          ((looking-back "[\]\)\}]" 1) (evil-jump-item))
          ;; now, try to succeed from inside of a bracket
          ((looking-at "[\]\)\}]") (forward-char) (evil-jump-item))
          ((looking-back "[\[\(\{]" 1) (backward-char) (evil-jump-item))
          (t nil)))

  (bind-key* "M--" 'idiig/goto-match-paren)
#+end_src

*** 点后插入空白
#+begin_src emacs-lisp
  (defun idiig/insert-space-after-point ()
    (interactive)
    (save-excursion (insert " ")))

  (bind-key* "C-." 'idiig/insert-space-after-point)
#+end_src

** 编程工具
*** 我有可能使用的语言
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  ;; TODO: 这里未来需要改成在每个语言的设定的节点push进来
  (defvar idiig/language-list
    '("emacs-lisp" "python" "ditaa" "plantuml" "shell" "nix"
      "R" "haskell" "latex" "css" "lisp" "jq" "makefile" "go")
    "支持的编程语言列表。")

  (defun idiig/run-prog-mode-hooks ()
    "Runs `prog-mode-hook'. 针对一些本该为编程语言又没自动加载prog mode的语言hook.
  如：(add-hook 'python-hook 'idiig/run-prog-mode-hooks)
  "
    (run-hooks 'prog-mode-hook))
#+end_src

*** 语言服务器 (=lsp-Bridge=)
:PROPERTIES:
:CUSTOM_ID: lsp-bridge
:END:
语言服务器用于补全代码，提示文档，参照转跳等。这里我使用了 LSP-Bridge，
其主要优势是通过 python 后端调用语言服务器，不卡 emacs 进程达到高速的
补全。其他倾向的代替选项有 emacs 捆绑 =eglot= 。
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  (lsp-bridge.override {
    # 指定使用 Python 3.11 而不是 3.12
    python3 = pkgs.python311;
  })
    markdown-mode
    yasnippet
#+end_src

这里由于默认的 python (3.12.9) 版本问题导致了下面的报错：

- 首先尝试导入 =SimpleXMLRPCServer= 模块失败，这是因为在 Python 3 中，
  该模块已被移至 =xmlrpc.server=
- 随后在导入 =xmlrpc.client= 时出现了一个奇怪的错误:
  ~'datetime.datetime' object has no attribute 'task'~

这可能是 Python 3.12.9 中的一个 bug，或者是 epc 包与 Python 3.12.9 不
兼容的结果。因此我们在 =lsp-bridge= 的环境中使用了 311 的版本。

#+begin_example
  Traceback (most recent call last):
    File "/nix/store/1bn994va1akp3m0jvg4fj9wzlqmn1kkq-python3-3.12.9-env/lib/python3.12/site-packages/epc/py3compat.py", line 26, in <module>
      import SimpleXMLRPCServer
  ModuleNotFoundError: No module named 'SimpleXMLRPCServer'

  During handling of the above exception, another exception occurred:

  Traceback (most recent call last):
    File "/nix/store/4mx09lzrlahhkgv7qb2q57xmnsfwcmlx-emacs-packages-deps/share/emacs/site-lisp/elpa/lsp-bridge-20250210.0/lsp_bridge.py", line 46, in <module>
      from epc.server import ThreadingEPCServer
    File "/nix/store/1bn994va1akp3m0jvg4fj9wzlqmn1kkq-python3-3.12.9-env/lib/python3.12/site-packages/epc/server.py", line 20, in <module>
      from .py3compat import SocketServer
    File "/nix/store/1bn994va1akp3m0jvg4fj9wzlqmn1kkq-python3-3.12.9-env/lib/python3.12/site-packages/epc/py3compat.py", line 28, in <module>
      import xmlrpc.server as SimpleXMLRPCServer
    File "/nix/store/26yi95240650jxp5dj78xzch70i1kzlz-python3-3.12.9/lib/python3.12/xmlrpc/server.py", line 107, in <module>
      from xmlrpc.client import Fault, dumps, loads, gzip_encode, gzip_decode
    File "/nix/store/26yi95240650jxp5dj78xzch70i1kzlz-python3-3.12.9/lib/python3.12/xmlrpc/client.py", line 272, in <module>
      if _try('%Y'):      # Mac OS X
         ^^^^^^^^^^
    File "/nix/store/26yi95240650jxp5dj78xzch70i1kzlz-python3-3.12.9/lib/python3.12/xmlrpc/client.py", line 269, in _try
      return _day0.strftime(fmt) == '0001'
             ^^^^^^^^^^^^^^^^^^^
  AttributeError: 'datetime.datetime' object has no attribute 'task'
#+end_example

**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
