README.html
<div id="outline-container-org993a978" class="outline-4">
<h4 id="org993a978"><span class="section-number-4">5.7.2.</span> 文档状态折行</h4>
<div class="outline-text-4" id="text-5-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun idiig/in-writing-environment-p ()
  "Check if current buffer file matches any pattern in idiig/writing-environment-list."
  (when (buffer-file-name)
    (cl-some (lambda (pattern)
               (string-match-p pattern (buffer-file-name)))
             idiig/writing-environment-list)))

(add-hook 'find-file-hook
          (lambda ()
            (when (idiig/in-writing-environment-p)
              (visual-line-mode 1))))

(with-eval-after-load 'diminish
  (diminish 'visual-line-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2aa7e2c" class="outline-4">
<h4 id="org2aa7e2c"><span class="section-number-4">5.7.3.</span> 在选中区域的状态下 <code>C-w</code> 删除选中的区域</h4>
<div class="outline-text-4" id="text-5-7-3">
<p>
在没选中的状态下删除上一个单词。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'puni
  (defun idiig/backward-kill-word-or-region (&amp;optional arg)
    (interactive "p")
    (if (region-active-p)
        (call-interactively #'puni-kill-active-region)
      (backward-kill-word arg)))

  (global-set-key (kbd "C-w") 'idiig/backward-kill-word-or-region))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec93a74" class="outline-4">
<h4 id="orgec93a74"><span class="section-number-4">5.7.4.</span> <code>C-M-\</code> 全局缩进</h4>
<div class="outline-text-4" id="text-5-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun idiig/indent-buffer()
  (interactive)
  (indent-region (point-min) (point-max)))

(defun idiig/indent-region-or-buffer()
  (interactive)
  (save-excursion
    (if (region-active-p)
        (progn
          (indent-region (region-beginning) (region-end)))
      (progn
        (idiig/indent-buffer)))))

(global-set-key (kbd "C-M-\\") 'idiig/indent-region-or-buffer)
(global-set-key (kbd "C-M-¥") 'idiig/indent-region-or-buffer)  ;; JIS keyboard
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf32a6fa" class="outline-4">
<h4 id="orgf32a6fa"><span class="section-number-4">5.7.5.</span> <code>Shift-Ret</code> 下方插入空白行</h4>
<div class="outline-text-4" id="text-5-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key [(shift return)] 'idiig/smart-open-line)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcee81d7" class="outline-4">
<h4 id="orgcee81d7"><span class="section-number-4">5.7.6.</span> <code>M--</code> 匹配到括号</h4>
<div class="outline-text-4" id="text-5-7-6">
<p>
TODO: 把 evil-jump-item 换成别的函数。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun idiig/goto-match-paren (arg)
  "Go to the matching if on (){}[], similar to vi style of % "
  (interactive "p")
  ;; first, check for "outside of bracket" positions expected by forward-sexp, etc
  (cond ((looking-at "[\[\(\{]") (evil-jump-item))
        ((looking-back "[\]\)\}]" 1) (evil-jump-item))
        ;; now, try to succeed from inside of a bracket
        ((looking-at "[\]\)\}]") (forward-char) (evil-jump-item))
        ((looking-back "[\[\(\{]" 1) (backward-char) (evil-jump-item))
        (t nil)))

(bind-key* "M--" 'idiig/goto-match-paren)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f86c67" class="outline-4">
<h4 id="org4f86c67"><span class="section-number-4">5.7.7.</span> 点后插入空白</h4>
<div class="outline-text-4" id="text-5-7-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun idiig/insert-space-after-point ()
  (interactive)
  (save-excursion (insert " ")))

(bind-key* "C-." 'idiig/insert-space-after-point)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1091962" class="outline-3">
<h3 id="org1091962"><span class="section-number-3">5.8.</span> 编程工具</h3>
<div class="outline-text-3" id="text-5-8">
</div>
<div id="outline-container-org7137073" class="outline-4">
<h4 id="org7137073"><span class="section-number-4">5.8.1.</span> 我有可能使用的语言</h4>
<div class="outline-text-4" id="text-5-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; TODO: 这里未来需要改成在每个语言的设定的节点push进来
(defvar idiig/language-list
  '("emacs-lisp" "python" "ditaa" "plantuml" "shell" "nix"
    "R" "haskell" "latex" "css" "lisp" "jq" "makefile" "go")
  "支持的编程语言列表。")

(defun idiig/run-prog-mode-hooks ()
  "Runs `prog-mode-hook'. 针对一些本该为编程语言又没自动加载prog mode的语言hook.
如：(add-hook 'python-hook 'idiig/run-prog-mode-hooks)
"
  (run-hooks 'prog-mode-hook))
</pre>
</div>
</div>
</div>
<div id="outline-container-lsp-bridge" class="outline-4">
<h4 id="lsp-bridge"><span class="section-number-4">5.8.2.</span> 语言服务器 (<code>lsp-Bridge</code>)</h4>
<div class="outline-text-4" id="text-lsp-bridge">
<p>
语言服务器用于补全代码，提示文档，参照转跳等。这里我使用了 LSP-Bridge，其主要优势是通过 python 后端调用语言服务器，不卡 emacs 进程达到高速的补全。其他倾向的代替选项有 emacs 捆绑 <code>eglot</code> 。
</p>
</div>
<ol class="org-ol">
<li><a id="org21ed9d7"></a>依赖<br />
<div class="outline-text-5" id="text-5-8-2-1">
<div class="org-src-container">
<pre class="src src-nix">(lsp-bridge.override {
  # 指定使用 Python 3.11 而不是 3.12
  python3 = pkgs.python311;
})
  markdown-mode
  yasnippet
</pre>
</div>

<p>
这里由于默认的 python (3.12.9) 版本问题导致了下面的报错：
</p>

<ul class="org-ul">
<li>首先尝试导入 <code>SimpleXMLRPCServer</code> 模块失败，这是因为在 Python 3 中，该模块已被移至 <code>xmlrpc.server</code></li>
<li>随后在导入 <code>xmlrpc.client</code> 时出现了一个奇怪的错误:
<code>'datetime.datetime' object has no attribute 'task'</code></li>
</ul>

<p>
这可能是 Python 3.12.9 中的一个 bug，或者是 epc 包与 Python 3.12.9 不兼容的结果。因此我们在 <code>lsp-bridge</code> 的环境中使用了 311 的版本。
</p>

<pre class="example" id="orga7c8ef6">
Traceback (most recent call last):
  File "/nix/store/1bn994va1akp3m0jvg4fj9wzlqmn1kkq-python3-3.12.9-env/lib/python3.12/site-packages/epc/py3compat.py", line 26, in &lt;module&gt;
    import SimpleXMLRPCServer
ModuleNotFoundError: No module named 'SimpleXMLRPCServer'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/nix/store/4mx09lzrlahhkgv7qb2q57xmnsfwcmlx-emacs-packages-deps/share/emacs/site-lisp/elpa/lsp-bridge-20250210.0/lsp_bridge.py", line 46, in &lt;module&gt;
    from epc.server import ThreadingEPCServer
  File "/nix/store/1bn994va1akp3m0jvg4fj9wzlqmn1kkq-python3-3.12.9-env/lib/python3.12/site-packages/epc/server.py", line 20, in &lt;module&gt;
    from .py3compat import SocketServer
  File "/nix/store/1bn994va1akp3m0jvg4fj9wzlqmn1kkq-python3-3.12.9-env/lib/python3.12/site-packages/epc/py3compat.py", line 28, in &lt;module&gt;
    import xmlrpc.server as SimpleXMLRPCServer
  File "/nix/store/26yi95240650jxp5dj78xzch70i1kzlz-python3-3.12.9/lib/python3.12/xmlrpc/server.py", line 107, in &lt;module&gt;
    from xmlrpc.client import Fault, dumps, loads, gzip_encode, gzip_decode
  File "/nix/store/26yi95240650jxp5dj78xzch70i1kzlz-python3-3.12.9/lib/python3.12/xmlrpc/client.py", line 272, in &lt;module&gt;
    if _try('%Y'):      # Mac OS X
       ^^^^^^^^^^
  File "/nix/store/26yi95240650jxp5dj78xzch70i1kzlz-python3-3.12.9/lib/python3.12/xmlrpc/client.py", line 269, in _try
    return _day0.strftime(fmt) == '0001'
           ^^^^^^^^^^^^^^^^^^^
AttributeError: 'datetime.datetime' object has no attribute 'task'
</pre>
</div>
</li>
