README.org
***** 后续的设置宏，用于配置 Nix 环境下的 LSP 服务器
#+begin_src emacs-lisp
  (defvar idiig/lsp-extra-paths nil
    "Emacs 侧已配置的 LSP 可执行目录清单。会被写入到项目的 .emacs-lsp-paths。")

  (defmacro idiig//setup-nix-lsp-bridge-server (language server-name executable-path &optional lib-path)
    "配置 Nix 环境下的 LSP 服务器。
  LANGUAGE 是语言名称，如 'python'。
  SERVER-NAME 是服务器名称，如 'basedpyright'。
  EXECUTABLE-PATH 是服务器可执行文件的路径。
  LIB-PATH 是可选的库路径，添加到 LD_LIBRARY_PATH。"
    `(with-eval-after-load 'lsp-bridge
       ;; 设置 LSP 服务器
       (setq ,(intern (format "lsp-bridge-%s-lsp-server" language)) ,server-name)
       
       ;; 添加可执行文件路径到 exec-path
       ,(when executable-path
          `(progn
  	   (add-to-list 'exec-path ,executable-path)
  	   (add-to-list 'idiig/lsp-extra-paths ,executable-path)))
       
       ;; 添加库路径到 LD_LIBRARY_PATH
       ,(when lib-path
          `(setenv "LD_LIBRARY_PATH" 
                   (concat ,lib-path ":" 
                           (or (getenv "LD_LIBRARY_PATH") ""))))))
#+end_src

上面这个宏用于生成 LSP-Bridge 的设定，因为语言服务器本身需要用户自己安
装，而本配置又需要 Nix 保证复现，所以我们需要把 nix 路径的语言服务器传
递给 emacs ，而且语言服务器往往需要匹配的 C++ 的库。因此我希望通过上面
的代码生成系列配置，同时设定语言，语言服务器，语言服务器的可执行文件路
径，依赖的 C 库。宏使用如下：

#+begin_src emacs-lisp :noweb-ref -
  (idiig//setup-nix-lsp-bridge-server 
   "python" 
   "basedpyright" 
   "${pkgs.basedpyright}/bin" 
   "${pkgs.stdenv.cc.cc.lib}/lib")
#+end_src

宏展开后如下：

#+begin_src emacs-lisp :noweb-ref -
  (with-eval-after-load 'lsp-bridge
    (setq lsp-bridge-python-lsp-bridge-server "basedpyright")
    (add-to-list 'exec-path "${pkgs.basedpyright}/bin")
    (setenv "LD_LIBRARY_PATH" 
            (concat "${pkgs.stdenv.cc.cc.lib}/lib:" 
                    (or (getenv "LD_LIBRARY_PATH") ""))))
#+end_src

后面是 LSP-Bridge 本体的配置：

#+begin_src emacs-lisp
  (use-package lsp-bridge
    :defer t
    :diminish lsp-bridge-mode
    :bind
    (:map acm-mode-map
          ("C-j" . acm-select-next)
          ("C-k" . acm-select-prev))
    :custom
    (acm-enable-yas nil)   ; 补全不包括 Yasnippet
    (acm-enable-doc nil)   ; 不自动显示函数等文档
    (lsp-bridge-org-babel-lang-list idiig/language-list)  ; org支持的代码也使用桥
    (acm-enable-icon nil)  ; 不显示图标
    :hook 
    (prog-mode . (lambda ()
  		 (lsp-bridge-mode)))
    :init
    ;; 这里是为了让语言服务器找到正确的版本的 libstdc++.so.6 库
    (setenv "LD_LIBRARY_PATH" 
            (concat "${pkgs.stdenv.cc.cc.lib}/lib:" 
                    (or (getenv "LD_LIBRARY_PATH") ""))))
#+end_src

*注意* ：语言服务器不会自动安装，如果在新电脑中出现缺少个别语言服务器
的情况，我们可以手动安装。
***** 弹窗补全优先设置
#+begin_src emacs-lisp
  (with-eval-after-load 'lsp-bridge
    (defun idiig/acm-prefer-lsp-all ()
      (when (bound-and-true-p lsp-bridge-mode)
        ;; 让 search 后端慢一点再来（避免覆盖 LSP）
        (when (boundp 'acm-backend-search-delay)
          (setq-local acm-backend-search-delay 0.8))  ;; 你可调成 0.6~1.0

        ;; 提高 LSP 优先级，降低 search 优先级（若有这些变量）
        (when (boundp 'acm-backend-lsp-priority)
          (setq-local acm-backend-lsp-priority 100))
        (when (boundp 'acm-backend-search-priority)
          (setq-local acm-backend-search-priority 0))

        ;; 可选：减少噪声（若存在这些开关）
        (when (boundp 'acm-enable-dabbrev)
          (setq-local acm-enable-dabbrev nil))          ; 关闭 dabbrev 后端
        (when (boundp 'acm-backend-search-candidates-min-length)
          (setq-local acm-backend-search-candidates-min-length 3)))) ; 至少 3 字符再搜

    (add-hook 'lsp-bridge-mode-hook #'idiig/acm-prefer-lsp-all))
#+end_src
*** TODO Treesitter
用于解析语法和语法高亮
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  # treesit  # 目前 treesit 已经内置
  treesit-auto
#+end_src

**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package treesit-auto
    :custom
    (treesit-auto-install 'prompt)   ; 设置安装 tree-sitter 语法时提示用户确认
    :hook
    (prog-mode . treesit-auto-mode)    ; 在所有编程模式下自动启用 treesit-auto-mode
    :config
    (treesit-auto-add-to-auto-mode-alist 'all))  ; 将所有已知的 tree-sitter 模式添加到自动模式列表中
#+end_src

这个配置设置了 =treesit-auto= 包，这是一个帮助管理和自动启用 Emacs 内
置 =tree-sitter= 模式的工具。会在启动 major mode 的时候自动替换为
=<major>-ts-mode= 。比如 python-mode 会变成 python-ts-mode。

*注意* ：treesit 不会自动安装，如果在新电脑中出现缺少 treesit 的情况，
我们可以手动 =treesit-auto-install-all= 。下载目前所有可能的语言的
treesit。

*** Snippet (=yasnippet=)
Snippet 用于快速插入模板
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
这里 =yasnippet= 本体已经作为 =lsp-bridge= 的依赖被加入，我们这里只加
入一个 snippet 的合集 =yasnippert-snippets= 。
#+begin_src nix
  # yasnippet
  yasnippet-snippets
    consult-yasnippet
#+end_src

**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  ;; (defvar idiig/snippet-dir (concat user-emacs-directory "snippets"))
  (use-package yasnippet
    :defer t
    :diminish yas-minor-mode
    :hook
    (prog-mode . yas-minor-mode)
    :init
    ;; (setq yas-snippet-dirs <path/to/snippets>)
    ;; (push idiig/snippet-dir yas-snippet-dirs)
    :config
    (yas-reload-all))
#+end_src

加载用于yasnippet的的合集

#+begin_src emacs-lisp
  (use-package consult-yasnippet
    :after
    (consult
     yas-minor-mode))
#+end_src

*** 基于 tresitter 的结构化编程
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
#+end_src

**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
#+end_src
*** 自动化环境管理 (=direnv=)
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  direnv
#+end_src
