README.html
<li><a id="org1c2bead"></a>配置<br />
<div class="outline-text-5" id="text-5-8-2-2">
</div>
<ol class="org-ol">
<li><a id="orgc83c26f"></a>后续的设置宏，用于配置 Nix 环境下的 LSP 服务器<br />
<div class="outline-text-6" id="text-5-8-2-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar idiig/lsp-extra-paths nil
  "Emacs 侧已配置的 LSP 可执行目录清单。会被写入到项目的 .emacs-lsp-paths。")

(defmacro idiig//setup-nix-lsp-bridge-server (language server-name executable-path &amp;optional lib-path)
  "配置 Nix 环境下的 LSP 服务器。
LANGUAGE 是语言名称，如 'python'。
SERVER-NAME 是服务器名称，如 'basedpyright'。
EXECUTABLE-PATH 是服务器可执行文件的路径。
LIB-PATH 是可选的库路径，添加到 LD_LIBRARY_PATH。"
  `(with-eval-after-load 'lsp-bridge
     ;; 设置 LSP 服务器
     (setq ,(intern (format "lsp-bridge-%s-lsp-server" language)) ,server-name)

     ;; 添加可执行文件路径到 exec-path
     ,(when executable-path
        `(progn
           (add-to-list 'exec-path ,executable-path)
           (add-to-list 'idiig/lsp-extra-paths ,executable-path)))

     ;; 添加库路径到 LD_LIBRARY_PATH
     ,(when lib-path
        `(setenv "LD_LIBRARY_PATH" 
                 (concat ,lib-path ":" 
                         (or (getenv "LD_LIBRARY_PATH") ""))))))
</pre>
</div>

<p>
上面这个宏用于生成 LSP-Bridge 的设定，因为语言服务器本身需要用户自己安装，而本配置又需要 Nix 保证复现，所以我们需要把 nix 路径的语言服务器传递给 emacs ，而且语言服务器往往需要匹配的 C++ 的库。因此我希望通过上面的代码生成系列配置，同时设定语言，语言服务器，语言服务器的可执行文件路径，依赖的 C 库。宏使用如下：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "python" 
 "basedpyright" 
 "${pkgs.basedpyright}/bin" 
 "${pkgs.stdenv.cc.cc.lib}/lib")
</pre>
</div>

<p>
宏展开后如下：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'lsp-bridge
  (setq lsp-bridge-python-lsp-bridge-server "basedpyright")
  (add-to-list 'exec-path "${pkgs.basedpyright}/bin")
  (setenv "LD_LIBRARY_PATH" 
          (concat "${pkgs.stdenv.cc.cc.lib}/lib:" 
                  (or (getenv "LD_LIBRARY_PATH") ""))))
</pre>
</div>

<p>
后面是 LSP-Bridge 本体的配置：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-bridge
  :defer t
  :diminish lsp-bridge-mode
  :bind
  (:map acm-mode-map
        ("C-j" . acm-select-next)
        ("C-k" . acm-select-prev))
  :custom
  (acm-enable-yas nil)   ; 补全不包括 Yasnippet
  (acm-enable-doc nil)   ; 不自动显示函数等文档
  (lsp-bridge-org-babel-lang-list idiig/language-list)  ; org支持的代码也使用桥
  (acm-enable-icon nil)  ; 不显示图标
  :hook 
  (prog-mode . (lambda ()
                 (lsp-bridge-mode)))
  :init
  ;; 这里是为了让语言服务器找到正确的版本的 libstdc++.so.6 库
  (setenv "LD_LIBRARY_PATH" 
          (concat "${pkgs.stdenv.cc.cc.lib}/lib:" 
                  (or (getenv "LD_LIBRARY_PATH") ""))))
</pre>
</div>

<p>
<b>注意</b> ：语言服务器不会自动安装，如果在新电脑中出现缺少个别语言服务器的情况，我们可以手动安装。
</p>
</div>
</li>
<li><a id="org509e3e6"></a>弹窗补全优先设置<br />
<div class="outline-text-6" id="text-5-8-2-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'lsp-bridge
  (defun idiig/acm-prefer-lsp-all ()
    (when (bound-and-true-p lsp-bridge-mode)
      ;; 让 search 后端慢一点再来（避免覆盖 LSP）
      (when (boundp 'acm-backend-search-delay)
        (setq-local acm-backend-search-delay 0.8))  ;; 你可调成 0.6~1.0

      ;; 提高 LSP 优先级，降低 search 优先级（若有这些变量）
      (when (boundp 'acm-backend-lsp-priority)
        (setq-local acm-backend-lsp-priority 100))
      (when (boundp 'acm-backend-search-priority)
        (setq-local acm-backend-search-priority 0))

      ;; 可选：减少噪声（若存在这些开关）
      (when (boundp 'acm-enable-dabbrev)
        (setq-local acm-enable-dabbrev nil))          ; 关闭 dabbrev 后端
      (when (boundp 'acm-backend-search-candidates-min-length)
        (setq-local acm-backend-search-candidates-min-length 3)))) ; 至少 3 字符再搜

  (add-hook 'lsp-bridge-mode-hook #'idiig/acm-prefer-lsp-all))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org2d4ab87" class="outline-4">
<h4 id="org2d4ab87"><span class="section-number-4">5.8.3.</span> <span class="todo TODO">TODO</span> Treesitter</h4>
<div class="outline-text-4" id="text-5-8-3">
<p>
用于解析语法和语法高亮
</p>
</div>
<ol class="org-ol">
<li><a id="orga41259a"></a>依赖<br />
<div class="outline-text-5" id="text-5-8-3-1">
<div class="org-src-container">
<pre class="src src-nix"># treesit  # 目前 treesit 已经内置
treesit-auto
</pre>
</div>
</div>
</li>
<li><a id="orgc833046"></a>配置<br />
<div class="outline-text-5" id="text-5-8-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)   ; 设置安装 tree-sitter 语法时提示用户确认
  :hook
  (prog-mode . treesit-auto-mode)    ; 在所有编程模式下自动启用 treesit-auto-mode
  :config
  (treesit-auto-add-to-auto-mode-alist 'all))  ; 将所有已知的 tree-sitter 模式添加到自动模式列表中
</pre>
</div>

<p>
这个配置设置了 <code>treesit-auto</code> 包，这是一个帮助管理和自动启用 Emacs 内置 <code>tree-sitter</code> 模式的工具。会在启动 major mode 的时候自动替换为
<code>&lt;major&gt;-ts-mode</code> 。比如 python-mode 会变成 python-ts-mode。
</p>

<p>
<b>注意</b> ：treesit 不会自动安装，如果在新电脑中出现缺少 treesit 的情况，我们可以手动 <code>treesit-auto-install-all</code> 。下载目前所有可能的语言的
treesit。
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgcfad172" class="outline-4">
<h4 id="orgcfad172"><span class="section-number-4">5.8.4.</span> Snippet (<code>yasnippet</code>)</h4>
<div class="outline-text-4" id="text-5-8-4">
<p>
Snippet 用于快速插入模板
</p>
</div>
<ol class="org-ol">
<li><a id="org3bc283e"></a>依赖<br />
<div class="outline-text-5" id="text-5-8-4-1">
<p>
这里 <code>yasnippet</code> 本体已经作为 <code>lsp-bridge</code> 的依赖被加入，我们这里只加入一个 snippet 的合集 <code>yasnippert-snippets</code> 。
</p>
<div class="org-src-container">
<pre class="src src-nix"># yasnippet
yasnippet-snippets
  consult-yasnippet
</pre>
</div>
</div>
</li>
<li><a id="org005a971"></a>配置<br />
<div class="outline-text-5" id="text-5-8-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (defvar idiig/snippet-dir (concat user-emacs-directory "snippets"))
(use-package yasnippet
  :defer t
  :diminish yas-minor-mode
  :hook
  (prog-mode . yas-minor-mode)
  :init
  ;; (setq yas-snippet-dirs &lt;path/to/snippets&gt;)
  ;; (push idiig/snippet-dir yas-snippet-dirs)
  :config
  (yas-reload-all))
</pre>
</div>

<p>
加载用于yasnippet的的合集
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package consult-yasnippet
  :after
  (consult
   yas-minor-mode))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org11ff8b4" class="outline-4">
<h4 id="org11ff8b4"><span class="section-number-4">5.8.5.</span> 基于 tresitter 的结构化编程</h4>
<div class="outline-text-4" id="text-5-8-5">
</div>
<ol class="org-ol">
