README.org
**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
启用 direnv-mode 使用 flake 定环境变量。
#+begin_src emacs-lisp
  (use-package direnv
    :defer t
    :init
    (add-to-list 'exec-path "${pkgs.direnv}/bin")
    :config
    (direnv-mode))
#+end_src

但是项目中的环境变量往往会修改PATH，导致 LSP 等工具找不到可执行文件。
而我并不想在flake里写LSP相关的配置，因为倭人为LSP是为了了补全和跳转，
而不是为了运行程序和复现环境。因此我们需要把 Emacs 的 exec-path 也合并
进 PATH 里，供子进程继承。
#+begin_src emacs-lisp
  (require 'cl-lib)

  (defun idiig/project-root ()
    "返回当前 buffer 对应的项目根（优先含 .envrc，其次 .git）。"
    (or (locate-dominating-file default-directory ".envrc")
        (locate-dominating-file default-directory ".git")
        default-directory))

  (defun idiig/write-emacs-lsp-paths ()
    "将 `idiig/lsp-extra-paths` 写入项目根的 .emacs-lsp-paths。"
    (interactive)
    (when-let* ((root (idiig/project-root))
                (file (expand-file-name ".emacs-lsp-paths" root)))
      (let* ((dirs (->> idiig/lsp-extra-paths
                        (seq-filter #'file-directory-p)
                        (delete-dups))))
        (when dirs
          (with-temp-file file
            (dolist (p dirs) (insert p "\n")))))))

  ;; lsp-bridge 项目根识别（避免偶发 no views）
  ;; direnv 集成：allow/refresh 前写清单；完成后自动重启 lsp-bridge
  (with-eval-after-load 'direnv
    ;; before：生成/更新 .emacs-lsp-paths，供 .envrc 读取
    (advice-add 'direnv-allow :before (lambda (&rest _) (idiig/write-emacs-lsp-paths)))
    (when (fboundp 'direnv-update-environment)
      (advice-add 'direnv-update-environment :before
                  (lambda (&rest _) (idiig/write-emacs-lsp-paths))))

    ;; after：环境就绪后，如有需要自动重启 lsp-bridge
    (defun idiig/direnv--restart-lsp-bridge (&rest _)
      (when (and (featurep 'lsp-bridge)
                 (fboundp 'lsp-bridge-restart-process)
                 (cl-some (lambda (buf)
                            (with-current-buffer buf
                              (bound-and-true-p lsp-bridge-mode)))
                          (buffer-list)))
        (lsp-bridge-restart-process)))
    (advice-add 'direnv-allow :after #'idiig/direnv--restart-lsp-bridge)
    (when (fboundp 'direnv-update-environment)
      (advice-add 'direnv-update-environment :after #'idiig/direnv--restart-lsp-bridge)))
#+end_src
*** 终端 (=eat=)
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  eat
#+end_src
**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  ;; For `eat-eshell-mode'.
  (add-hook 'eshell-load-hook #'eat-eshell-mode)

  ;; For `eat-eshell-visual-command-mode'.
  (add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode)
#+end_src
** 编程与文档语言
*** Nix
**** 依赖
#+begin_src nix :noweb-ref epkgs
  nix-mode
#+end_src

加入 nix 的 major mode。
#+begin_src emacs-lisp :noweb-ref ecfg
  (idiig//setup-nix-lsp-bridge-server 
   "nix" 
   "nixd" 
   "${pkgs.nixd}/bin" 
   nil)
#+end_src

设置 nix 的语言服务器。注意这里使用的是在 LSP-Bridge 节中写的宏（参看
[[#lsp-bridge]]）。

**** 配置
*** Lisp
**** RERL
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
***** 依赖
#+begin_src nix
  slime
    geiser                        # for scheme
#+end_src
***** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (use-package slime
    :init
    (setq inferior-lisp-program
  	(or (executable-find "sbcl")
  	    "${pkgs.sbcl}/bin/sbcl"))
    :config
    (slime-setup '(slime-fancy)))
#+end_src
**** 方言
***** Elisp
****** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
- =M-:= 时的 eval expression minibuffer 的时候加入 prog mode。
#+begin_src emacs-lisp
  (add-hook 'eval-expression-minibuffer-setup 'idiig/run-prog-mode-hooks)
#+end_src

***** Clojure
****** 依赖
#+begin_src emacs-lisp :noweb-ref ecfg
  (idiig//setup-nix-lsp-bridge-server 
   "clojure" 				; language name
   "clojure-lsp" 				; lsp name
   "${pkgs.clojure-lsp}/bin"		; dependency nixpkg path
   nil)					; other dependencies
#+end_src

*** Python
**** 本体
***** 依赖
#+begin_src emacs-lisp :noweb-ref ecfg
  (idiig//setup-nix-lsp-bridge-server 
   "python" 
   "basedpyright" 
   "${pkgs.basedpyright}/bin" 
   "${pkgs.stdenv.cc.cc.lib}/lib")
#+end_src
***** 配置
**** 虚拟环境
*** Haskell
**** 本体
***** 依赖
Major mode:
#+begin_src nix :noweb-ref epkgs
  haskell-mode
#+end_src

#+begin_src emacs-lisp :noweb-ref ecfg
  (idiig//setup-nix-lsp-bridge-server 
   "haskell"
   "hls" 
   "${pkgs.haskell-language-server}/bin" 
   nil)
#+end_src
*** R
*** Go
**** 本体
***** 依赖
Major mode:
#+begin_src nix :noweb-ref epkgs
  go-mode
#+end_src

LSP:
#+begin_src emacs-lisp :noweb-ref ecfg
  (idiig//setup-nix-lsp-bridge-server 
   "go" 
   "gopls" 
   "${pkgs.gopls}/bin" 
   nil)
#+end_src
***** 配置
#+begin_src emacs-lisp :noweb-ref ecfg
  (defun idiig/go-prefer-lsp ()
    (when (derived-mode-p 'go-mode 'go-ts-mode)
      ;; 关闭文件内/跨缓冲词搜索后端（如果你的版本有这些开关）
      (when (boundp 'acm-enable-search-file-words)
        (setq-local acm-enable-search-file-words nil))
      (when (boundp 'acm-enable-dabbrev)
        (setq-local acm-enable-dabbrev nil))
      ;; 把搜索词的延迟调大，避免覆盖（若有这个变量）
      (when (boundp 'acm-backend-search-delay)
        (setq-local acm-backend-search-delay 0.8))
      ;; LSP 候选最短前缀更短一些（若有）
      (when (boundp 'acm-backend-lsp-candidate-min-length)
        (setq-local acm-backend-lsp-candidate-min-length 0))))
  (add-hook 'go-mode-hook #'idiig/go-prefer-lsp)
  (add-hook 'go-ts-mode-hook #'idiig/go-prefer-lsp)
#+end_src
*** Shell
**** 依赖
#+begin_src emacs-lisp :noweb-ref ecfg
  (idiig//setup-nix-lsp-bridge-server 
   "bash" 				; language name
   "bash-language-server" 		; lsp name
   "${pkgs.bash-language-server}/bin" 	; dependency nixpkg path
   nil)					; other dependencies
#+end_src

**** 配置
