README.html
<li><a id="orgb5248e2"></a>依赖<br />
<div class="outline-text-5" id="text-5-8-5-1">
<div class="org-src-container">
<pre class="src src-nix">
</pre>
</div>
</div>
</li>
<li><a id="org4502a57"></a>配置<br />
<div class="outline-text-5" id="text-5-8-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd68ece4" class="outline-4">
<h4 id="orgd68ece4"><span class="section-number-4">5.8.6.</span> 自动化环境管理 (<code>direnv</code>)</h4>
<div class="outline-text-4" id="text-5-8-6">
</div>
<ol class="org-ol">
<li><a id="org1b2c021"></a>依赖<br />
<div class="outline-text-5" id="text-5-8-6-1">
<div class="org-src-container">
<pre class="src src-nix">direnv
</pre>
</div>
</div>
</li>
<li><a id="org4c15ff8"></a>配置<br />
<div class="outline-text-5" id="text-5-8-6-2">
<p>
启用 direnv-mode 使用 flake 定环境变量。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package direnv
  :defer t
  :init
  (add-to-list 'exec-path "${pkgs.direnv}/bin")
  :config
  (direnv-mode))
</pre>
</div>

<p>
但是项目中的环境变量往往会修改PATH，导致 LSP 等工具找不到可执行文件。而我并不想在flake里写LSP相关的配置，因为倭人为LSP是为了了补全和跳转，而不是为了运行程序和复现环境。因此我们需要把 Emacs 的 exec-path 也合并进 PATH 里，供子进程继承。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'cl-lib)

(defun idiig/project-root ()
  "返回当前 buffer 对应的项目根（优先含 .envrc，其次 .git）。"
  (or (locate-dominating-file default-directory ".envrc")
      (locate-dominating-file default-directory ".git")
      default-directory))

(defun idiig/write-emacs-lsp-paths ()
  "将 `idiig/lsp-extra-paths` 写入项目根的 .emacs-lsp-paths。"
  (interactive)
  (when-let* ((root (idiig/project-root))
              (file (expand-file-name ".emacs-lsp-paths" root)))
    (let* ((dirs (-&gt;&gt; idiig/lsp-extra-paths
                      (seq-filter #'file-directory-p)
                      (delete-dups))))
      (when dirs
        (with-temp-file file
          (dolist (p dirs) (insert p "\n")))))))

;; lsp-bridge 项目根识别（避免偶发 no views）
;; direnv 集成：allow/refresh 前写清单；完成后自动重启 lsp-bridge
(with-eval-after-load 'direnv
  ;; before：生成/更新 .emacs-lsp-paths，供 .envrc 读取
  (advice-add 'direnv-allow :before (lambda (&amp;rest _) (idiig/write-emacs-lsp-paths)))
  (when (fboundp 'direnv-update-environment)
    (advice-add 'direnv-update-environment :before
                (lambda (&amp;rest _) (idiig/write-emacs-lsp-paths))))

  ;; after：环境就绪后，如有需要自动重启 lsp-bridge
  (defun idiig/direnv--restart-lsp-bridge (&amp;rest _)
    (when (and (featurep 'lsp-bridge)
               (fboundp 'lsp-bridge-restart-process)
               (cl-some (lambda (buf)
                          (with-current-buffer buf
                            (bound-and-true-p lsp-bridge-mode)))
                        (buffer-list)))
      (lsp-bridge-restart-process)))
  (advice-add 'direnv-allow :after #'idiig/direnv--restart-lsp-bridge)
  (when (fboundp 'direnv-update-environment)
    (advice-add 'direnv-update-environment :after #'idiig/direnv--restart-lsp-bridge)))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7692796" class="outline-4">
<h4 id="org7692796"><span class="section-number-4">5.8.7.</span> 终端 (<code>eat</code>)</h4>
<div class="outline-text-4" id="text-5-8-7">
</div>
<ol class="org-ol">
<li><a id="orgeeb5538"></a>依赖<br />
<div class="outline-text-5" id="text-5-8-7-1">
<div class="org-src-container">
<pre class="src src-nix">eat
</pre>
</div>
</div>
</li>
<li><a id="org2e97bf3"></a>配置<br />
<div class="outline-text-5" id="text-5-8-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; For `eat-eshell-mode'.
(add-hook 'eshell-load-hook #'eat-eshell-mode)

;; For `eat-eshell-visual-command-mode'.
(add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode)
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org9859c3b" class="outline-3">
<h3 id="org9859c3b"><span class="section-number-3">5.9.</span> 编程与文档语言</h3>
<div class="outline-text-3" id="text-5-9">
</div>
<div id="outline-container-org5bdb37a" class="outline-4">
<h4 id="org5bdb37a"><span class="section-number-4">5.9.1.</span> Nix</h4>
<div class="outline-text-4" id="text-5-9-1">
</div>
<ol class="org-ol">
<li><a id="orgda11f6a"></a>依赖<br />
<div class="outline-text-5" id="text-5-9-1-1">
<div class="org-src-container">
<pre class="src src-nix">nix-mode
</pre>
</div>

<p>
加入 nix 的 major mode。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "nix" 
 "nixd" 
 "${pkgs.nixd}/bin" 
 nil)
</pre>
</div>

<p>
设置 nix 的语言服务器。注意这里使用的是在 LSP-Bridge 节中写的宏（参看
<a href="#lsp-bridge">5.8.2</a>）。
</p>
</div>
</li>
<li><a id="orgbc075b7"></a>配置<br /></li>
</ol>
</div>
<div id="outline-container-orgd58a2dc" class="outline-4">
<h4 id="orgd58a2dc"><span class="section-number-4">5.9.2.</span> Lisp</h4>
<div class="outline-text-4" id="text-5-9-2">
</div>
<ol class="org-ol">
<li><a id="org67f0682"></a>RERL<br />
<div class="outline-text-5" id="text-5-9-2-1">
</div>
<ol class="org-ol">
<li><a id="orgde03a01"></a>依赖<br />
<div class="outline-text-6" id="text-5-9-2-1-1">
<div class="org-src-container">
<pre class="src src-nix">slime
  geiser                        # for scheme
</pre>
</div>
</div>
</li>
<li><a id="org551f4bc"></a>配置<br />
<div class="outline-text-6" id="text-5-9-2-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package slime
  :init
  (setq inferior-lisp-program
        (or (executable-find "sbcl")
            "${pkgs.sbcl}/bin/sbcl"))
  :config
  (slime-setup '(slime-fancy)))
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orgfec4475"></a>方言<br />
<ol class="org-ol">
<li><a id="orgef6c3ee"></a>Elisp<br />
<ol class="org-ol">
<li><a id="org0f969e8"></a>配置<br />
<div class="outline-text-7" id="text-5-9-2-2-1-1">
<ul class="org-ul">
<li><code>M-:</code> 时的 eval expression minibuffer 的时候加入 prog mode。</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'eval-expression-minibuffer-setup 'idiig/run-prog-mode-hooks)
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orgf552bf0"></a>Clojure<br />
<ol class="org-ol">
<li><a id="org370c035"></a>依赖<br />
<div class="outline-text-7" id="text-5-9-2-2-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "clojure" 				; language name
 "clojure-lsp" 				; lsp name
 "${pkgs.clojure-lsp}/bin"		; dependency nixpkg path
 nil)					; other dependencies
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org37018eb" class="outline-4">
<h4 id="org37018eb"><span class="section-number-4">5.9.3.</span> Python</h4>
<div class="outline-text-4" id="text-5-9-3">
</div>
<ol class="org-ol">
<li><a id="org9c4eb94"></a>本体<br />
<ol class="org-ol">
<li><a id="orgea73392"></a>依赖<br />
<div class="outline-text-6" id="text-5-9-3-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "python" 
 "basedpyright" 
 "${pkgs.basedpyright}/bin" 
 "${pkgs.stdenv.cc.cc.lib}/lib")
</pre>
</div>
</div>
</li>
<li><a id="orgb8f19fd"></a>配置<br /></li>
</ol>
</li>
<li><a id="org3945ae3"></a>虚拟环境<br /></li>
</ol>
</div>
<div id="outline-container-org805a26f" class="outline-4">
<h4 id="org805a26f"><span class="section-number-4">5.9.4.</span> Haskell</h4>
<div class="outline-text-4" id="text-5-9-4">
</div>
<ol class="org-ol">
<li><a id="org7a97911"></a>本体<br />
<ol class="org-ol">
<li><a id="org27a7eb5"></a>依赖<br />
<div class="outline-text-6" id="text-5-9-4-1-1">
<p>
Major mode:
</p>
<div class="org-src-container">
<pre class="src src-nix">haskell-mode
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "haskell"
 "hls" 
 "${pkgs.haskell-language-server}/bin" 
 nil)
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org24185ab" class="outline-4">
<h4 id="org24185ab"><span class="section-number-4">5.9.5.</span> R</h4>
</div>
<div id="outline-container-org14e3a26" class="outline-4">
<h4 id="org14e3a26"><span class="section-number-4">5.9.6.</span> Go</h4>
<div class="outline-text-4" id="text-5-9-6">
</div>
<ol class="org-ol">
<li><a id="org1fb55a9"></a>本体<br />
<ol class="org-ol">
<li><a id="org505d828"></a>依赖<br />
<div class="outline-text-6" id="text-5-9-6-1-1">
<p>
Major mode:
</p>
<div class="org-src-container">
<pre class="src src-nix">go-mode
</pre>
</div>

<p>
LSP:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "go" 
 "gopls" 
 "${pkgs.gopls}/bin" 
 nil)
</pre>
</div>
</div>
</li>
<li><a id="org95fb93e"></a>配置<br />
<div class="outline-text-6" id="text-5-9-6-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun idiig/go-prefer-lsp ()
  (when (derived-mode-p 'go-mode 'go-ts-mode)
    ;; 关闭文件内/跨缓冲词搜索后端（如果你的版本有这些开关）
    (when (boundp 'acm-enable-search-file-words)
      (setq-local acm-enable-search-file-words nil))
    (when (boundp 'acm-enable-dabbrev)
      (setq-local acm-enable-dabbrev nil))
    ;; 把搜索词的延迟调大，避免覆盖（若有这个变量）
    (when (boundp 'acm-backend-search-delay)
      (setq-local acm-backend-search-delay 0.8))
    ;; LSP 候选最短前缀更短一些（若有）
    (when (boundp 'acm-backend-lsp-candidate-min-length)
      (setq-local acm-backend-lsp-candidate-min-length 0))))
(add-hook 'go-mode-hook #'idiig/go-prefer-lsp)
(add-hook 'go-ts-mode-hook #'idiig/go-prefer-lsp)
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgd172290" class="outline-4">
<h4 id="orgd172290"><span class="section-number-4">5.9.7.</span> Shell</h4>
<div class="outline-text-4" id="text-5-9-7">
</div>
<ol class="org-ol">
<li><a id="org0e74e0b"></a>依赖<br />
<div class="outline-text-5" id="text-5-9-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "bash" 				; language name
 "bash-language-server" 		; lsp name
 "${pkgs.bash-language-server}/bin" 	; dependency nixpkg path
 nil)					; other dependencies
</pre>
</div>
</div>
</li>
