README.org
***** 用 =bash= 作为默认 shell
#+begin_src emacs-lisp :noweb-ref ecfg
  ;; (setq shell-command-switch "-ic")
  (setq-default explicit-shell-file-name "${pkgs.bashInteractive
  }/bin/bash")
  (setq shell-file-name "${pkgs.bashInteractive
  }/bin/bash")
#+end_src

*** jq
#+begin_src nix :noweb-ref epkgs
  jq-mode
#+end_src
*** Make
*** TeX
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src nix :noweb-ref epkgs
  auctex
    auctex-latexmk
#+end_src

#+begin_src emacs-lisp
  (idiig//setup-nix-lsp-bridge-server 
   "tex" 
   "texlab" 
   "${pkgs.texlab}/bin" 
   nil)
#+end_src

**** 配置
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (add-hook 'TeX-mode-hook 'idiig/run-prog-mode-hooks)
#+end_src

#+begin_src emacs-lisp
  (use-package auctex
    :defer t)
#+end_src

*** Typst

*** Markdown

*** Quarto

*** XML
*** JSON
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src nix :noweb-ref epkgs
  jsonian
    json-mode
#+end_src

#+begin_src emacs-lisp
  (idiig//setup-nix-lsp-bridge-server 
   "json" 
   "vscode-json-language-server" 
   "${pkgs.vscode-langservers-extracted}/bin" 
   nil)
#+end_src
**** 配置
#+begin_src emacs-lisp :noweb-ref ecfg
  (use-package jsonian
    :after so-long
    :custom
    (jsonian-no-so-long-mode))
#+end_src
*** Web

*** Java
**** 依赖
#+begin_src nix :noweb-ref 
  (pkgs.jre_minimal)
#+end_src

*** PlantUML
**** 依赖
:PROPERTIES:
:header-args: :noweb-ref epkgs
:END:
#+begin_src nix
  plantuml-mode
#+end_src

#+begin_src emacs-lisp :noweb-ref ecfg
  (add-to-list 'exec-path "${pkgs.plantuml}/bin")
  (with-eval-after-load 'org
    (setq org-plantuml-jar-path "${pkgs.plantuml}/lib/plantuml.jar")
    (setq org-plantuml-executable-path "${pkgs.plantuml}/bin/plantuml")
    (setq org-plantuml-exec-mode 'plantuml))
#+end_src

*** GraphViz
**** 依赖
#+begin_src emacs-lisp :noweb-ref ecfg
  (add-to-list 'exec-path "${pkgs.graphviz}/bin")
#+end_src
** Org相关配置
*** Org本体
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
**** 绑定 prog mode
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'idiig/run-prog-mode-hooks)
#+end_src

**** 代码块支持语言
***** 依赖
由于 =ob-nix=, =ob-go= 还没有默认。我们需要添加这些依赖
#+begin_src nix :noweb-ref epkgs
  ob-nix
    ob-go
#+end_src
***** 配置
#+begin_src emacs-lisp
  (defun idiig/load-org-babel-languages ()
    "根据 `idiig/language-list` 启用 `org-babel` 语言。"
    (let ((languages '()))
      (dolist (lang idiig/language-list)
        (push (cons (intern lang) t) languages)) ;; 将字符串转换为符号
      (org-babel-do-load-languages 'org-babel-load-languages languages)))

  (defun idiig/set-org-babel-language-commands ()
    "根据 `idiig/language-list` 甚至语言的命令。"
    (dolist (lang idiig/language-list)
      (let ((var-name (intern (format "org-babel-%s-command" lang))))
        (when (boundp var-name)
  	(set var-name (executable-find lang))))))

  (add-hook 'org-mode-hook #'idiig/load-org-babel-languages)
  (add-hook 'org-mode-hook #'idiig/set-org-babel-language-commands)

  ;; 特殊
  (setq org-babel-shell-command (executable-find "bash"))
#+end_src
**** 结构化插入Babel模板
=org-insert-structure-template= 后选择 =s= (src block) 时自动提示插入代码
块的语言。

更改这个函数：
- 新增一个功能，如果输入的语言不在列表里，则把语言加入列表。但仅限于当
  前org文档
- 新增一个功能，根据输入的语言更新推荐语言的排序。
#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (defun idiig/org-insert-structure-template-src-advice (orig-fun type)
      "Advice for org-insert-structure-template to handle src blocks."
      (if (string= type "src")  ; 判断条件为 "src"
  	(let ((selected-type (ido-completing-read "Source code type: " idiig/language-list)))
  	  (funcall orig-fun (format "src %s" selected-type)))
        (funcall orig-fun type)))

    (advice-add 'org-insert-structure-template :around #'idiig/org-insert-structure-template-src-advice))
#+end_src
**** 基础设定
***** 默认进入 org-mode 时的设定
- 显示图片
- 显示 LaTeX 公式
- 折叠显示所有顶层节点
- 展开显示当前节点内容
- 展开显示所有子节点但不展开下一级
#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-startup-with-inline-images t) ; 启动时显示图片
    (setq org-startup-with-latex-preview t) ; 启动时显示 LaTeX 公式
    (add-hook 'org-mode-hook
              (lambda ()
                (org-overview)		  ; 显示所有顶层节点
  	      (org-show-entry)		  ; 显示当前节点内容
                (org-show-children)	  ; 显示所有子节点但不展开
  	      (org-fold-hide-block-all)	  ; 隐藏所有代码块
  	      (org-fold-hide-drawer-all)))) ; 隐藏所有抽屉
#+end_src
***** 允许shift用于选择
#+begin_src emacs-lisp 
  (with-eval-after-load 'org
    (setq org-support-shift-select 2))
#+end_src
***** 远程图片文件可以通过 =C-u C-c C-x C-v= 被看到
#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-display-remote-inline-images t))
#+end_src
***** 允许 =#+bind= 关键词
#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (setq org-export-allow-bind-keywords t))
#+end_src
**** 面貌
***** 基础美化
:PROPERTIES:
:header-args: :noweb-ref ecfg
:END:
#+begin_src emacs-lisp
  (with-eval-after-load 'org
   ;; Edit settings
   (setq org-auto-align-tags nil		; 禁用标签自动对齐功能
         org-tags-column 0		; 标签紧贴标题文本，不右对齐
         org-catch-invisible-edits 'show-and-error  ; 编辑折叠内容时显示并报错提醒
         org-special-ctrl-a/e t ; 增强 C-a/C-e，先跳到内容开始/结束，再跳到行首/尾
         org-insert-heading-respect-content t ; 插入标题时考虑内容结构，在内容后插入

         ;; Org styling, hide markup etc.
         org-hide-emphasis-markers t ; 隐藏强调标记符号 (*粗体* 显示为 粗体)
         org-pretty-entities t))	  ; 美化显示实体字符 (\alpha 显示为 α)
#+end_src
