README.html
<li><a id="orge4b44a8"></a>配置<br />
<ol class="org-ol">
<li><a id="org0bcbebd"></a>用 <code>bash</code> 作为默认 shell<br />
<div class="outline-text-6" id="text-5-9-7-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (setq shell-command-switch "-ic")
(setq-default explicit-shell-file-name "${pkgs.bashInteractive
}/bin/bash")
(setq shell-file-name "${pkgs.bashInteractive
}/bin/bash")
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org6a49d6d" class="outline-4">
<h4 id="org6a49d6d"><span class="section-number-4">5.9.8.</span> jq</h4>
<div class="outline-text-4" id="text-5-9-8">
<div class="org-src-container">
<pre class="src src-nix">jq-mode
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ca55c0" class="outline-4">
<h4 id="org5ca55c0"><span class="section-number-4">5.9.9.</span> Make</h4>
</div>
<div id="outline-container-org66b1763" class="outline-4">
<h4 id="org66b1763"><span class="section-number-4">5.9.10.</span> TeX</h4>
<div class="outline-text-4" id="text-5-9-10">
</div>
<ol class="org-ol">
<li><a id="orgb3980b1"></a>依赖<br />
<div class="outline-text-5" id="text-5-9-10-1">
<div class="org-src-container">
<pre class="src src-nix">auctex
  auctex-latexmk
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "tex" 
 "texlab" 
 "${pkgs.texlab}/bin" 
 nil)
</pre>
</div>
</div>
</li>
<li><a id="orgb0c5d72"></a>配置<br />
<div class="outline-text-5" id="text-5-9-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'TeX-mode-hook 'idiig/run-prog-mode-hooks)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package auctex
  :defer t)
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org5bc426e" class="outline-4">
<h4 id="org5bc426e"><span class="section-number-4">5.9.11.</span> Typst</h4>
</div>

<div id="outline-container-org11b5bec" class="outline-4">
<h4 id="org11b5bec"><span class="section-number-4">5.9.12.</span> Markdown</h4>
</div>

<div id="outline-container-orgce1f1f6" class="outline-4">
<h4 id="orgce1f1f6"><span class="section-number-4">5.9.13.</span> Quarto</h4>
</div>

<div id="outline-container-org3746008" class="outline-4">
<h4 id="org3746008"><span class="section-number-4">5.9.14.</span> XML</h4>
</div>
<div id="outline-container-org0d7321f" class="outline-4">
<h4 id="org0d7321f"><span class="section-number-4">5.9.15.</span> JSON</h4>
<div class="outline-text-4" id="text-5-9-15">
</div>
<ol class="org-ol">
<li><a id="orgd2169b7"></a>依赖<br />
<div class="outline-text-5" id="text-5-9-15-1">
<div class="org-src-container">
<pre class="src src-nix">jsonian
  json-mode
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(idiig//setup-nix-lsp-bridge-server 
 "json" 
 "vscode-json-language-server" 
 "${pkgs.vscode-langservers-extracted}/bin" 
 nil)
</pre>
</div>
</div>
</li>
<li><a id="org7060645"></a>配置<br />
<div class="outline-text-5" id="text-5-9-15-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package jsonian
  :after so-long
  :custom
  (jsonian-no-so-long-mode))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge63066f" class="outline-4">
<h4 id="orge63066f"><span class="section-number-4">5.9.16.</span> Web</h4>
</div>

<div id="outline-container-orgc0efa34" class="outline-4">
<h4 id="orgc0efa34"><span class="section-number-4">5.9.17.</span> Java</h4>
<div class="outline-text-4" id="text-5-9-17">
</div>
<ol class="org-ol">
<li><a id="org013f33c"></a>依赖<br />
<div class="outline-text-5" id="text-5-9-17-1">
<div class="org-src-container">
<pre class="src src-nix">(pkgs.jre_minimal)
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org276ae8b" class="outline-4">
<h4 id="org276ae8b"><span class="section-number-4">5.9.18.</span> PlantUML</h4>
<div class="outline-text-4" id="text-5-9-18">
</div>
<ol class="org-ol">
<li><a id="org31a97b2"></a>依赖<br />
<div class="outline-text-5" id="text-5-9-18-1">
<div class="org-src-container">
<pre class="src src-nix">plantuml-mode
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'exec-path "${pkgs.plantuml}/bin")
(with-eval-after-load 'org
  (setq org-plantuml-jar-path "${pkgs.plantuml}/lib/plantuml.jar")
  (setq org-plantuml-executable-path "${pkgs.plantuml}/bin/plantuml")
  (setq org-plantuml-exec-mode 'plantuml))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgad530d6" class="outline-4">
<h4 id="orgad530d6"><span class="section-number-4">5.9.19.</span> GraphViz</h4>
<div class="outline-text-4" id="text-5-9-19">
</div>
<ol class="org-ol">
<li><a id="orgd4619a0"></a>依赖<br />
<div class="outline-text-5" id="text-5-9-19-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'exec-path "${pkgs.graphviz}/bin")
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgb2aad78" class="outline-3">
<h3 id="orgb2aad78"><span class="section-number-3">5.10.</span> Org相关配置</h3>
<div class="outline-text-3" id="text-5-10">
</div>
<div id="outline-container-orgf29628f" class="outline-4">
<h4 id="orgf29628f"><span class="section-number-4">5.10.1.</span> Org本体</h4>
<div class="outline-text-4" id="text-5-10-1">
</div>
<ol class="org-ol">
<li><a id="orgc29199f"></a>绑定 prog mode<br />
<div class="outline-text-5" id="text-5-10-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'org-mode-hook 'idiig/run-prog-mode-hooks)
</pre>
</div>
</div>
</li>
<li><a id="org70e0e15"></a>代码块支持语言<br />
<ol class="org-ol">
<li><a id="org3fd9122"></a>依赖<br />
<div class="outline-text-6" id="text-5-10-1-2-1">
<p>
由于 <code>ob-nix</code>, <code>ob-go</code> 还没有默认。我们需要添加这些依赖
</p>
<div class="org-src-container">
<pre class="src src-nix">ob-nix
  ob-go
</pre>
</div>
</div>
</li>
<li><a id="orgf1c864a"></a>配置<br />
<div class="outline-text-6" id="text-5-10-1-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun idiig/load-org-babel-languages ()
  "根据 `idiig/language-list` 启用 `org-babel` 语言。"
  (let ((languages '()))
    (dolist (lang idiig/language-list)
      (push (cons (intern lang) t) languages)) ;; 将字符串转换为符号
    (org-babel-do-load-languages 'org-babel-load-languages languages)))

(defun idiig/set-org-babel-language-commands ()
  "根据 `idiig/language-list` 甚至语言的命令。"
  (dolist (lang idiig/language-list)
    (let ((var-name (intern (format "org-babel-%s-command" lang))))
      (when (boundp var-name)
        (set var-name (executable-find lang))))))

(add-hook 'org-mode-hook #'idiig/load-org-babel-languages)
(add-hook 'org-mode-hook #'idiig/set-org-babel-language-commands)

;; 特殊
(setq org-babel-shell-command (executable-find "bash"))
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orgf926b7e"></a>结构化插入Babel模板<br />
<div class="outline-text-5" id="text-5-10-1-3">
<p>
<code>org-insert-structure-template</code> 后选择 <code>s</code> (src block) 时自动提示插入代码块的语言。
</p>

<p>
更改这个函数：
</p>
<ul class="org-ul">
<li>新增一个功能，如果输入的语言不在列表里，则把语言加入列表。但仅限于当前org文档</li>
<li>新增一个功能，根据输入的语言更新推荐语言的排序。</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
  (defun idiig/org-insert-structure-template-src-advice (orig-fun type)
    "Advice for org-insert-structure-template to handle src blocks."
    (if (string= type "src")  ; 判断条件为 "src"
        (let ((selected-type (ido-completing-read "Source code type: " idiig/language-list)))
          (funcall orig-fun (format "src %s" selected-type)))
      (funcall orig-fun type)))

  (advice-add 'org-insert-structure-template :around #'idiig/org-insert-structure-template-src-advice))
</pre>
</div>
</div>
</li>
<li><a id="org5916227"></a>基础设定<br />
<ol class="org-ol">
<li><a id="orga6897f2"></a>默认进入 org-mode 时的设定<br />
<div class="outline-text-6" id="text-5-10-1-4-1">
<ul class="org-ul">
<li>显示图片</li>
<li>显示 LaTeX 公式</li>
<li>折叠显示所有顶层节点</li>
<li>展开显示当前节点内容</li>
<li>展开显示所有子节点但不展开下一级</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
  (setq org-startup-with-inline-images t) ; 启动时显示图片
  (setq org-startup-with-latex-preview t) ; 启动时显示 LaTeX 公式
  (add-hook 'org-mode-hook
            (lambda ()
              (org-overview)		; 显示所有顶层节点
              (org-show-entry)		; 显示当前节点内容
              (org-show-children))))	; 显示所有子节点但不展开
</pre>
</div>
</div>
</li>
<li><a id="orga3be730"></a>允许shift用于选择<br />
<div class="outline-text-6" id="text-5-10-1-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
  (setq org-support-shift-select 2))
</pre>
</div>
</div>
</li>
<li><a id="orga91f3a6"></a>远程图片文件可以通过 <code>C-u C-c C-x C-v</code> 被看到<br />
<div class="outline-text-6" id="text-5-10-1-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
  (setq org-display-remote-inline-images t))
</pre>
</div>
</div>
</li>
<li><a id="org852bfef"></a>允许 <code>#+bind</code> 关键词<br />
<div class="outline-text-6" id="text-5-10-1-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
  (setq org-export-allow-bind-keywords t))
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="org06133af"></a>面貌<br />
<ol class="org-ol">
<li><a id="org7c036e3"></a>基础美化<br />
<div class="outline-text-6" id="text-5-10-1-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
 ;; Edit settings
 (setq org-auto-align-tags nil		; 禁用标签自动对齐功能
       org-tags-column 0		; 标签紧贴标题文本，不右对齐
       org-catch-invisible-edits 'show-and-error  ; 编辑折叠内容时显示并报错提醒
       org-special-ctrl-a/e t ; 增强 C-a/C-e，先跳到内容开始/结束，再跳到行首/尾
       org-insert-heading-respect-content t ; 插入标题时考虑内容结构，在内容后插入

       ;; Org styling, hide markup etc.
       org-hide-emphasis-markers t ; 隐藏强调标记符号 (*粗体* 显示为 粗体)
       org-pretty-entities t))	  ; 美化显示实体字符 (\alpha 显示为 α)
</pre>
</div>
</div>
</li>
