README.html
<li><a id="org693d6ea"></a>字体，缩进，换行设定<br />
<div class="outline-text-6" id="text-5-10-1-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun idiig/org-mode-face-settings ()
  "Set custom face attributes for Org mode headings in current buffer only."

  (auto-fill-mode 0)			; Disable auto-fill mode
  (require 'org-indent)			; Ensure org-indent is loaded
  (org-indent-mode)			; Enable org-indent mode
  (variable-pitch-mode 1)		; Enable variable-pitch mode
  (visual-line-mode 1)			; Enable visual-line mode for soft wrapping

  (defvar idiig/fixed-width-font "Sarasa Mono J"
    "The font to use for monospaced (fixed width) text.")

  (defvar idiig/variable-width-font "Sarasa Gothic J"
    "The font to use for variable-pitch (document) text.")

  (set-face-attribute 'default nil
                      :font idiig/fixed-width-font
                      :weight 'regular
                      :height 160)
  (set-face-attribute 'fixed-pitch nil
                      :font idiig/fixed-width-font
                      :weight 'regular
                      :height 170)
  (set-face-attribute 'variable-pitch nil
                      :font idiig/variable-width-font
                      :weight 'regular
                      :height 1.3)
  (buffer-face-set `(:family ,idiig/fixed-width-font
                             :height 1.1)) ; Set buffer face

  (setq-local line-spacing 0.3)		; Set line spacing

  (let ((faces '((org-level-1 . 1.2)
                 (org-level-2 . 1.1)
                 (org-level-3 . 1.05)
                 (org-level-4 . 1.0)
                 (org-level-5 . 1.1)
                 (org-level-6 . 1.1)
                 (org-level-7 . 1.1)
                 (org-level-8 . 1.1))))
    (dolist (face faces)
      `(face-remap-add-relative (car face)
                               :family ,idiig/variable-width-font
                               :weight 'regular
                               :height (cdr face))))

  ;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  ;; Make the document title a bit bigger
  (set-face-attribute 'org-document-title nil :font idiig/variable-width-font :weight 'bold :height 1.3)

  (with-eval-after-load 'diminish
    (diminish 'org-indent-mode)
    (diminish 'buffer-face-mode)))

(add-hook 'org-mode-hook 'idiig/org-mode-face-settings)
</pre>
</div>
</div>
</li>
<li><a id="org52417cf"></a>数学渲染<br />
<div class="outline-text-6" id="text-5-10-1-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
  (add-to-list
   'org-preview-latex-process-alist
   '(idiig-dvisvgm
     :programs ("${pkgs.texliveMedium}/bin/latex" "${pkgs.texliveMedium}/bin/dvisvgm")
     :description "latex -&gt; dvi -&gt; svg (nix-store)"
     :message "use latex and dvisvgm from nix-store."
     :image-input-type "dvi"
     :image-output-type "svg"
     :image-size-adjust (0.8 . 1.0)
     :latex-compiler ("${pkgs.texliveMedium}/bin/latex -interaction nonstopmode -output-directory %o %f")
     :image-converter ("${pkgs.texliveMedium}/bin/dvisvgm %f --no-fonts --exact-bbox --scale=%S --output=%O")))

  (setq org-latex-create-formula-image-program 'idiig-dvisvgm))
</pre>
</div>
</div>
</li>
<li><a id="org6e7c9d7"></a>Bullets<br />
<ol class="org-ol">
<li><a id="orgbc5ff46"></a>依赖<br />
<div class="outline-text-7" id="text-5-10-1-5-4-1">
<div class="org-src-container">
<pre class="src src-nix">org-bullets
</pre>
</div>
</div>
</li>
<li><a id="orge13eddc"></a>配置<br />
<div class="outline-text-7" id="text-5-10-1-5-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(with-eval-after-load 'org
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org2cbab1a" class="outline-4">
<h4 id="org2cbab1a"><span class="section-number-4">5.10.2.</span> 文献引用处理器 (<code>citeproc-el</code>)</h4>
<div class="outline-text-4" id="text-5-10-2">
</div>
<ol class="org-ol">
<li><a id="orgf313813"></a>依赖<br />
<div class="outline-text-5" id="text-5-10-2-1">
<div class="org-src-container">
<pre class="src src-nix">citeproc
</pre>
</div>
</div>
</li>
<li><a id="org9360e5c"></a>配置<br />
<div class="outline-text-5" id="text-5-10-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'org
  (setq org-cite-export-processors
      '((latex biblatex)
        (html csl)
        (odt  csl)
        (t    biblatex))))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7942b11" class="outline-4">
<h4 id="org7942b11"><span class="section-number-4">5.10.3.</span> 出入引用配置 (<code>oc</code>, <code>oc-basic</code>)</h4>
<div class="outline-text-4" id="text-5-10-3">
<p>
<code>org-cite</code> 增强：插入后选择样式和参数。
</p>
</div>
<ol class="org-ol">
