README.html
<li><a id="org72cbc0c"></a>配置<br />
<div class="outline-text-5" id="text-5-10-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-eval-after-load 'oc
  (require 'oc-basic)
  (require 'subr-x)

  ;; 样式选择和参数输入
  (defun my/oc--ask-style-and-affixes ()
    "询问 citation 样式和附加参数。"
    (let* ((style-help "
Style examples:
  cite/a/cf → Citeauthor – Aa, Bb, and Cc
  cite/a/c  → Citeauthor – Aa et al.
  cite/na   → citeyear – 2022
  cite/na/b → citeyearpar – (2022)
  cite/t/c  → Citet – Aa et al. (2022)
  cite/t/cf → citep* – Aa, Bb, and Cc (2022)
  cite/bc   → Cite – Aa et al. 2022
  cite/cf   → Citep – (Aa et al. 2022)")
           (presets '(("cite/a/cf" . ("a"  . "cf"))
                      ("cite/a/c"  . ("a"  . "c"))
                      ("cite/na"   . ("na" . ""))
                      ("cite/na/b" . ("na" . "b"))
                      ("cite/t/c"  . ("t"  . "c"))
                      ("cite/t/cf" . ("t"  . "cf"))
                      ("cite/bc"   . ("bc" . ""))
                      ("cite/cf"   . ("cf" . ""))))
           (choice (completing-read
                    "Citation style (? for help): "
                    (append (mapcar #'car presets) '("custom" "?"))
                    nil t nil nil "cite/cf"))
           (l "") (b ""))

      ;; 显示帮助
      (when (string= choice "?")
        (message "%s" style-help)
        (sit-for 3)
        (setq choice (completing-read "Citation style: "
                                      (append (mapcar #'car presets) '("custom"))
                                      nil t nil nil "cite/cf")))

      ;; 获取样式
      (if (not (string= choice "custom"))
          (let ((p (cdr (assoc choice presets))))
            (setq l (car p) b (cdr p)))
        (setq l (completing-read "Style (l): " '("a" "na" "t" "bc" "c" "cf" "") nil t ""))
        (setq b (completing-read "Variant (b): " '("b" "c" "cf" "") nil t "")))

      ;; 构建完整样式和参数
      (let* ((style (string-join (seq-filter (lambda (x) (and x (not (string-empty-p x))))
                                             (list l b))
                                 "/"))
             (prefix  (read-string "Prefix (optional): "))
             (locator (read-string "Locator (optional): "))
             (suffix  (read-string "Suffix (optional): ")))
        (list style prefix locator suffix))))

  ;; 修改插入点的 citation
  (defun my/oc--rewrite-cite-at-point (style prefix locator suffix)
    "在当前位置修改 citation 的样式和参数。"
    (save-excursion
      (let* ((ctx (org-element-context))
             (cite (if (eq (org-element-type ctx) 'citation)
                       ctx
                     (when (re-search-backward "\\[cite\\&gt;" (max (point-min) (- (point) 1000)) t)
                       (org-with-point-at (match-beginning 0)
                         (org-element-citation-parser))))))
        (when cite
          (let* ((beg (org-element-begin cite))
                 (end (org-element-end   cite))
                 (has-style (save-excursion (goto-char beg) (looking-at-p "\\[cite/")))
                 (has-colon (save-excursion
                              (goto-char beg)
                              (re-search-forward "\\[cite\\(?:/[^:]]+\\)?\\(:\\)" end t))))

            ;; 添加样式
            (when (and (not has-style) (not (string-empty-p style)))
              (goto-char (+ beg 5))
              (insert "/" style)
              (setq end (+ end (length style) 1)))

            ;; 添加前缀
            (when (not (string-empty-p prefix))
              (unless has-colon
                (goto-char beg)
                (re-search-forward "\\[cite\\(?:/[^:]]+\\)?" end t)
                (insert ":")
                (setq end (1+ end)))
              (goto-char beg)
              (re-search-forward ":" end t)
              (insert prefix " ")
              (setq end (+ end (length prefix) 1)))

            ;; 添加定位符
            (when (not (string-empty-p locator))
              (goto-char beg)
              (when (re-search-forward "@[^; \t\n]+" end t)
                (insert " " locator)
                (setq end (+ end (length locator) 1))))

            ;; 添加后缀
            (when (not (string-empty-p suffix))
              (goto-char (1- end))
              (insert " " suffix)))))))

  ;; 主 advice：插入后弹出二次对话
  (defun my/oc-insert-then-ask (orig-fn arg)
    "插入引用后询问样式和参数。"
    (let ((ret (funcall orig-fn arg)))
      (run-at-time
       0 nil
       (lambda ()
         (condition-case err
             (pcase-let ((`(,style ,prefix ,locator ,suffix)
                          (my/oc--ask-style-and-affixes)))
               (my/oc--rewrite-cite-at-point style prefix locator suffix))
           (quit  (message "Citation style canceled"))
           (error (message "Error setting citation style: %s" (error-message-string err))))))
      ret))

  ;; 挂载 advice
  (advice-add 'org-cite-insert :around #'my/oc-insert-then-ask))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org87c80dc" class="outline-4">
<h4 id="org87c80dc"><span class="section-number-4">5.10.4.</span> 幻灯片 (<code>org-present</code>)</h4>
<div class="outline-text-4" id="text-5-10-4">
<p>
用 <code>org-present</code> 作幻灯片发表。手动开启。
</p>
</div>
<ol class="org-ol">
<li><a id="org4f7ea94"></a>依赖<br />
<div class="outline-text-5" id="text-5-10-4-1">
<div class="org-src-container">
<pre class="src src-nix">org-present
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgb3a30b2" class="outline-3">
<h3 id="orgb3a30b2"><span class="section-number-3">5.11.</span> AI辅助功能</h3>
<div class="outline-text-3" id="text-5-11">
</div>
<div id="outline-container-orgb442a04" class="outline-4">
<h4 id="orgb442a04"><span class="section-number-4">5.11.1.</span> Copilot</h4>
<div class="outline-text-4" id="text-5-11-1">
</div>
<ol class="org-ol">
<li><a id="org64e5c68"></a>依赖<br />
<div class="outline-text-5" id="text-5-11-1-1">
<div class="org-src-container">
<pre class="src src-nix">copilot
</pre>
</div>
</div>
</li>
<li><a id="org19e1107"></a>配置<br />
<div class="outline-text-5" id="text-5-11-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package copilot
  :hook (prog-mode . copilot-mode)
  :config
  (define-key copilot-completion-map (kbd "&lt;tab&gt;") 'copilot-accept-completion)
  (add-to-list 'copilot-indentation-alist '(prog-mode 2))
  (add-to-list 'copilot-indentation-alist '(org-mode 2))
  (add-to-list 'copilot-indentation-alist '(text-mode 2))
  (add-to-list 'copilot-indentation-alist '(lisp-mode 2))
  (add-to-list 'copilot-indentation-alist '(emacs-lisp-mode 2))

  (setq copilot-max-char 99999999))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgac02828" class="outline-4">
<h4 id="orgac02828"><span class="section-number-4">5.11.2.</span> Chatbot (<code>gptel)</code></h4>
<div class="outline-text-4" id="text-5-11-2">
</div>
<ol class="org-ol">
<li><a id="org7c7b218"></a>依赖<br />
<div class="outline-text-5" id="text-5-11-2-1">
<div class="org-src-container">
<pre class="src src-nix">gptel
</pre>
</div>
</div>
</li>
<li><a id="org786a3b3"></a>配置<br />
<div class="outline-text-5" id="text-5-11-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'org-mode-hook
          (lambda ()
            (when (string-match-p "\\.ai\\.org\\'" (buffer-file-name))
              (gptel-mode 1))))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org676a018" class="outline-4">
<h4 id="org676a018"><span class="section-number-4">5.11.3.</span> AI-pairing programming (<code>Aidermacs</code>)</h4>
<div class="outline-text-4" id="text-5-11-3">
</div>
<ol class="org-ol">
<li><a id="org810d34f"></a>依赖<br />
<div class="outline-text-5" id="text-5-11-3-1">
</div>
<ol class="org-ol">
<li><a id="orgd15dcc5"></a>aidermacs.el<br />
<div class="outline-text-6" id="text-5-11-3-1-1">
<div class="org-src-container">
<pre class="src src-nix">aidermacs
</pre>
</div>
</div>
</li>
<li><a id="orgd4ccad9"></a>Aider 目录路径<br />
<div class="outline-text-6" id="text-5-11-3-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'exec-path "${pkgs.aider-chat}/bin")
</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orge91c214"></a>配置<br />
<div class="outline-text-5" id="text-5-11-3-2">
<p>
<code>Aidermacs</code> 是一个用于在 Emacs 中使用 <code>Aider</code> 的 AI 辅助编程工具，集成了多种 AI 模型服务，帮助用户在编程过程中获得智能建议和辅助。
</p>
</div>
<ol class="org-ol">
