README.html
<li><a id="org185cd8f"></a>API Key 环境变量<br />
<div class="outline-text-6" id="text-5-11-3-2-1">
<p>
它需要 API Key 来使用 OpenAI 或者其他模型服务。目前我主要支持的模型服务提供商有 OpenAI、Anthropic 和 Google。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar idiig/supported-providers '("openai" "anthropic" "google")
  "List of supported AI providers for Aider.")

(defun idiig/provider-env-var (provider)
  "Return the environment variable name for the given PROVIDER.
Uppercase the provider name and append '_API_KEY'."
  (let ((provider-lower (downcase provider)))
    (if (member provider-lower idiig/supported-providers)
        (concat (upcase provider-lower) "_API_KEY")
      (error "Unsupported provider: %s" provider))))

(defun idiig/api-path (provider dir)
  "Return the file path for the API key of PROVIDER in directory DIR."
  (expand-file-name provider dir))

(defun idiig/read-file-contents (file-path)
  "Return the contents of FILE-PATH as a string, with error handling."
  (condition-case err
      (if (file-exists-p file-path)
          (string-trim (with-temp-buffer
                         (insert-file-contents file-path)
                         (buffer-string)))
        (error "File does not exist: %s" file-path))
    (error
     (message "Error reading file %s: %s" file-path (error-message-string err))
     nil)))

(defun idiig/setup-single-provider (provider api-dir)
  "Set up API key for a single PROVIDER from API-DIR.
Return t on success, nil on failure."
  (let* ((provider-env (idiig/provider-env-var provider))
         (provider-path (idiig/api-path provider api-dir))
         (api-key (idiig/read-file-contents provider-path)))
    (if api-key
        (progn
          (setenv provider-env api-key)
          (message "Set %s from %s" provider-env provider-path)
          t)
      (progn
        (message "Failed to read API key for %s from %s" provider provider-path)
        nil))))

(defun idiig/get-default-api-dir ()
  "Get the default API directory.
Check if 'api-key' or 'api-keys' folder exists in current directory.
Return the path if found, otherwise return current directory."
  (let ((current-dir default-directory)
        (possible-dirs '("api-key" "api-keys")))
    (or (seq-find (lambda (dir)
                    (let ((full-path (expand-file-name dir current-dir)))
                      (and (file-directory-p full-path) full-path)))
                  possible-dirs)
        ;; If none found, query user for directory using `read-directory-name`
        (read-directory-name "Select API keys directory: " current-dir nil t))))

(defun idiig/setup-api-keys (&amp;optional api-dir)
  "Set up API keys for Aider from directory containing API files.
If API-DIR is provided, use it directly. Otherwise, check if current
folder has 'api-key' or 'api-keys' folder and use it as default.
Interactively prompts for the directory with smart default."
  (interactive)
  (let* ((default-dir (idiig/get-default-api-dir))
         (prompt (if (string= default-dir default-directory)
                     "Select API keys directory: "
                   (format "Select API keys directory (default: %s): " 
                           (file-name-nondirectory (directory-file-name default-dir)))))
         (selected-dir (if (called-interactively-p 'any)
                           (read-directory-name prompt default-dir)
                         (or api-dir default-dir)))
         (results (mapcar (lambda (provider)
                            (idiig/setup-single-provider provider selected-dir))
                          idiig/supported-providers))
         (success-count (length (seq-filter #'identity results)))
         (total-count (length idiig/supported-providers)))

    ;; Provide comprehensive feedback
    (if (= success-count total-count)
        (message "Successfully set all %d API keys from directory: %s" 
                 total-count selected-dir)
      (message "Set %d of %d API keys from directory: %s (check messages for details)"
               success-count total-count selected-dir))

    ;; Return success status for programmatic use
    (= success-count total-count)))
</pre>
</div>
</div>
</li>
<li><a id="orgfa94312"></a><code>Aidermacs</code> 配置<br />
<div class="outline-text-6" id="text-5-11-3-2-2">
<p>
启用 <code>C-c a</code> 快捷键打开菜单。默认使用 <code>sonnet</code> 模型。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package aidermacs
  :bind (("C-c a" . aidermacs-transient-menu))
  :config
  (idiig/setup-api-keys)
  :custom
  (aidermacs-default-chat-mode 'architect)
  (aidermacs-default-model "sonnet"))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgb67bf42" class="outline-4">
<h4 id="orgb67bf42"><span class="section-number-4">5.11.4.</span> <span class="todo TODO">TODO</span> AI-Client (<code>claude-code</code>)</h4>
<div class="outline-text-4" id="text-5-11-4">
</div>
<ol class="org-ol">
<li><a id="orgb71a80c"></a>依赖<br />
<div class="outline-text-5" id="text-5-11-4-1">
<div class="org-src-container">
<pre class="src src-nix">claude-code
</pre>
</div>
</div>
</li>
<li><a id="orgaa41904"></a>配置<br />
<div class="outline-text-5" id="text-5-11-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Add to your init.el
(use-package claude-code
  :init
  (add-to-list 'exec-path "${pkgs.claude-code}/bin")
  :bind (("C-c c" . claude-code-transient)))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
