README.html
<div id="outline-container-org091a0de" class="outline-3">
<h3 id="org091a0de"><span class="section-number-3">5.12.</span> 模态编辑 (<code>meow</code>)</h3>
<div class="outline-text-3" id="text-5-12">
</div>
<div id="outline-container-org07c8a33" class="outline-4">
<h4 id="org07c8a33"><span class="section-number-4">5.12.1.</span> 依赖</h4>
<div class="outline-text-4" id="text-5-12-1">
<div class="org-src-container">
<pre class="src src-nix">meow
  meow-tree-sitter
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc6e1886" class="outline-4">
<h4 id="orgc6e1886"><span class="section-number-4">5.12.2.</span> 配置</h4>
<div class="outline-text-4" id="text-5-12-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package meow
  :init
  ;; https://github.com/meow-edit/meow/blob/master/KEYBINDING_QWERTY.org
  (require 'meow)
  (defun meow-setup ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
    (meow-motion-define-key
     '("j" . meow-next)
     '("k" . meow-prev)
     '("&lt;escape&gt;" . ignore))
    (meow-leader-define-key
     ;; Use SPC (0-9) for digit arguments.
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     '("/" . meow-keypad-describe-key)
     '("?" . meow-cheatsheet))
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . meow-change)
     '("d" . meow-delete)
     '("D" . meow-backward-delete)
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("g" . meow-cancel-selection)
     '("G" . meow-grab)
     '("h" . meow-left)
     '("H" . meow-left-expand)
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("j" . meow-next)
     '("J" . meow-next-expand)
     '("k" . meow-prev)
     '("K" . meow-prev-expand)
     '("l" . meow-right)
     '("L" . meow-right-expand)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-yank)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-kill)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . meow-visit)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("x" . meow-line)
     '("X" . meow-goto-line)
     '("y" . meow-save)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("&lt;escape&gt;" . ignore)))
  (meow-setup)
  :config
  (meow-global-mode 1))
</pre>
</div>

<p>
给meow增加treesitter的功能：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'meow-tree-sitter)
(meow-tree-sitter-register-defaults)  
</pre>
</div>

<p>
在 meow-edit 退出 insert-state 时，当前输入方式自动被关闭，而再次进入
insert-state 时重新打开输入方式：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar-local the-late-input-method nil)
(add-hook 'meow-insert-enter-hook
          (lambda ()
            (activate-input-method the-late-input-method)))
(add-hook 'meow-insert-exit-hook
          (lambda ()
            (setq the-late-input-method current-input-method)
            (deactivate-input-method)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org10853f9" class="outline-3">
<h3 id="org10853f9"><span class="section-number-3">5.13.</span> 多线程丰富功能 (<code>EAF</code>)</h3>
<div class="outline-text-3" id="text-5-13">
<p>
EAF（Emacs Application Framework）是一个在 Emacs 中运行的应用框架，我偶尔使用这个框架来使用浏览器和 PDF 阅读器等应用。
</p>
</div>
<div id="outline-container-org1fabbd5" class="outline-4">
<h4 id="org1fabbd5"><span class="section-number-4">5.13.1.</span> 依赖</h4>
<div class="outline-text-4" id="text-5-13-1">
<div class="org-src-container">
<pre class="src src-nix">(eaf.withApplications [ eaf-browser eaf-pdf-viewer ])
</pre>
</div>
</div>
</div>
<div id="outline-container-org7527fcf" class="outline-4">
<h4 id="org7527fcf"><span class="section-number-4">5.13.2.</span> 配置</h4>
<div class="outline-text-4" id="text-5-13-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'eaf)
(require 'eaf-browser)
(require 'eaf-pdf-viewer)
(add-to-list 'exec-path "${pkgs.wmctrl}/bin")
(setq eaf-webengine-default-zoom 2.0
        eaf-browse-blank-page-url "https://www.kagi.com"
        eaf-browser-auto-import-chrome-cookies nil   ; 非自动 cookies
        eaf-browser-enable-autofill t                ; 自动填充密码
        eaf-browser-enable-tampermonkey t)	     ; 使用油猴
</pre>
</div>
</div>
</div>
</div>
