README.html
<div id="outline-container-org4c23f4b" class="outline-3">
<h3 id="org4c23f4b"><span class="section-number-3">5.14.</span> 特殊扩展</h3>
<div class="outline-text-3" id="text-5-14">
<p>
扩展主要针对不存在于 <code>nixpkgs</code> 中的包，这里我基本上使用了<a href="https://codeberg.org/heraplem/nix-emacs-extra/src/branch/emacs-application-framework/packages/eaf">这个链接的代码和方法</a>，由于Nix水平有限，我在代码中增加了一些注释提示自己：
</p>

<div class="org-src-container">
<pre class="src src-nix">{ inputs, pkgs, emacsPackages }: let
  inherit (builtins) readDir;
  inherit (pkgs) runCommand;
  inherit (pkgs.lib) attrNames attrsToList filter functionArgs hasAttr mergeAttrsList pipe readFile remove;
  packagesDir = ./.;
  packageSources = inputs // {
    # nano = inputs.nano-emacs;
  };
  importFile = dir: let
    packageFunction = import "${packagesDir}/${dir}";
  in emacsPackages.callPackage packageFunction (
    pipe ({
      elispFileVersion = file: let
        output = runCommand "${baseNameOf file}-version" { } ''
          ${emacsPackages.emacs}/bin/emacs -Q --batch \
            --eval "(require 'lisp-mnt)" \
            --eval '(setq pkg-version (lm-version "${file}"))' \
            --eval '(find-file (getenv "out"))' \
            --eval '(insert pkg-version)' \
            --eval '(save-buffer)'
        '';
      in readFile output;
      pkgFileVersion = file: let
        output = runCommand "${baseNameOf file}-version" { } ''
          ${emacsPackages.emacs}/bin/emacs -Q --batch \
            --eval '(find-file "${file}")' \
            --eval '(setq pkg-version (caddr (read (current-buffer))))' \
            --eval '(find-file (getenv "out"))' \
            --eval '(insert pkg-version)' \
            --eval '(save-buffer)'
        '';
      in readFile output;
      normalizeVersion = name: version: let
        output = runCommand "${name}-normalized-version" { } ''
          ${emacsPackages.emacs}/bin/emacs -Q --batch \
            --load package \
            --eval '(setq pkg-version (package-version-join (version-to-list "${version}")))' \
            --eval '(find-file (getenv "out"))' \
            --eval '(insert pkg-version)' \
            --eval '(save-buffer)'
        '';
      in readFile output;
      genericBuild = emacsPackages.callPackage "${inputs.nixpkgs}/pkgs/applications/editors/emacs/build-support/generic.nix" { };
      elpa2nix = "${inputs.nixpkgs}/pkgs/applications/editors/emacs/build-support/elpa2nix.el";
      melpa2nix = "${inputs.nixpkgs}/pkgs/applications/editors/emacs/build-support/melpa2nix.el";
    } // (if hasAttr dir packageSources then { package_src = packageSources.${dir}; } else { })
    ) [
      attrsToList
      # =&gt; [ 
      #      { name = "elispFileVersion"; value = &lt;function&gt;; }
      #      { name = "pkgFileVersion"; value = &lt;function&gt;; }
      #      { name = "normalizeVersion"; value = &lt;function&gt;; }
      #      { name = "genericBuild"; value = &lt;function&gt;; }
      #      { name = "elpa2nix"; value = "/path/to/elpa2nix.el"; }
      #      { name = "melpa2nix"; value = "/path/to/melpa2nix.el"; }
      #    ]
      (filter ({ name, ... }: hasAttr name (functionArgs packageFunction)))
      # =&gt; 假设 packageFunction 需要 elispFileVersion 和 genericBuild
      # =&gt; [ 
      #      { name = "elispFileVersion"; value = &lt;function&gt;; }
      #      { name = "genericBuild"; value = &lt;function&gt;; }
      #    ]
      (map ({ name, value }: { ${name} = value; }))
      # =&gt; [
      #      { elispFileVersion = &lt;function&gt;; }
      #      { genericBuild = &lt;function&gt;; }
      #    ]
      mergeAttrsList
      # =&gt; { 
      #      elispFileVersion = &lt;function&gt;;
      #      genericBuild = &lt;function&gt;;
      #    }
      # 一般来讲，我们会这么写 import XXX.nix { inherit attr; };
      # 这里相当于最后得到一个传入 XXX.nix 的一个参数集
    ]
  );  # Nix 中 pipe 的写法是 pipe &lt;初始对象&gt; [ &lt;函数1&gt; &lt;函数2&gt; ... ]
in pipe packagesDir [                            # =&gt; ./. (当前包目录)
  readDir                                        # =&gt; { "package1" = "directory"; "package2" = "directory"; "default.nix" = "regular"; ... }
  attrNames                                      # =&gt; [ "package1" "package2" "default.nix" ... ]
  (remove "default.nix")                         # =&gt; [ "package1" "package2" ... ]
  (map (dir: { "${dir}" = importFile dir; }))    # =&gt; [ { "package1" = &lt;derivation&gt;; } { "package2" = &lt;derivation&gt;; } ... ]
  mergeAttrsList                                 # =&gt; { "package1" = &lt;derivation&gt;; "package2" = &lt;derivation&gt;; ... }
]
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.lit-prog" class="footnum" href="#fnr.lit-prog" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
关于文学编程中 <code>noweb</code> 的解释可以参考 <a href="https://www.cs.tufts.edu/~nr/noweb/">这个链接</a> 。本身我们还有一个
<code>:session</code> 的方式更适合一些数据科学的工作流。这里我们主要为了和 <code>:tangle</code>
以前使用。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: idiig</p>
<p class="date">Created: 2025-11-04 Tue 02:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
